Divan_e_Hafez = {
        "غزل۱": """اَلا یا اَیُّهَا السّاقی اَدِرْ کَأسَاً و ناوِلْها
که عشق آسان نمود اوّل ولی افتاد مشکل‌ها
به بویِ نافه‌ای کآخر صبا زان طُرّه بگشاید
ز تابِ جَعدِ مشکینش چه خون افتاد در دل‌ها
مرا در منزلِ جانان چه امنِ عیش چون هر دَم
جَرَس فریاد می‌دارد که بَربندید مَحمِل‌ها
به مِی سجّاده رنگین کن گَرت پیرِ مُغان گوید
که سالِک بی‌خبر نَبوَد ز راه و رسمِ منزل‌ها
شبِ تاریک و بیمِ موج و گردابی چنین هایل
کجا دانند حالِ ما سبکبارانِ ساحل‌ها
همه کارم ز خودکامی به بدنامی کشید آخر
نهان کِی مانَد آن رازی کزو سازند محفل‌ها
حضوری گر همی‌خواهی از او غایب مشو حافظ
مَتٰی ما تَلْقَ مَنْ تَهْویٰ دَعِ الدُّنْیا و اَهْمِلْها""",

        "غزل۲": """صلاحِ کار کجا و منِ خراب کجا
ببین تفاوتِ ره کز کجاست تا به کجا
دلم ز صومعه بگرفت و خِرقِهٔ سالوس
کجاست دیرِ مُغان و شرابِ ناب کجا
چه نسبت است به‌رندی صَلاح و تقوا را
سماعِ وعظ کجا نغمهٔ رباب کجا
ز رویِ دوست دلِ دشمنان چه دریابد
چراغِ مرده کجا شمعِ آفتاب کجا
چو کُحلِ بینشِ ما خاکِ آستانِ شماست
کجا رویم بفرما ازین جناب کجا
مبین به سیبِ زَنَخدان که چاه در راه است
کجا همی‌ روی ای دل بدین شتاب کجا
بشد که یاد خوشش باد روزگارِ وصال
خود آن کرشمه کجا رفت و آن عِتاب کجا
قرار و خواب ز حافظ طمع مدار ای دوست
قرار چیست صبوری کدام و خواب کجا""",

        "غرل۳": """اگر آن تُرک شیرازی به دست آرد دل ما را
به خال هِندویَش بخشم سمرقند و بخارا را
بده ساقی مِیِ باقی که در جنت نخواهی یافت
کنار آب رُکن آباد و گُلگَشت مُصَلّا را
فَغان کاین لولیانِ شوخِ شیرین‌کار شهرآشوب
چنان بردند صبر از دل که تُرکان خوان یغما را
ز عشق ناتمام ما جمال یار مُستَغنی است
به آب و رنگ و خال و خط چه حاجت روی زیبا را؟
من از آن حسن روزافزون که یوسف داشت دانستم
که عشق از پردهٔ عصمت برون آرد زلیخا را
اگر دشنام فرمایی و گر نفرین، دعا گویم
جواب تلخ می‌زیبد، لب لعل شکرخا را
نصیحت گوش کن جانا که از جان دوست‌تر دارند
جوانان سعادتمند پند پیر دانا را
حدیث از مطرب و مِی گو و راز دَهر کمتر جو
که کس نگشود و نگشاید به حکمت این معما را
غزل گفتی و دُر سفتی، بیا و خوش بخوان حافظ
که بر نظم تو افشاند فلک عِقد ثریا را""",

"غزل۴" : """صبا به لطف بگو آن غزال رعنا را
که سر به کوه و بیابان تو داده‌ای ما را
شکرفروش که عمرش دراز باد چرا
تَفَقُّدی نکند طوطی شکرخا را
غرور حُسنت اجازت مگر نداد ای گل؟
که پرسشی نکنی عَندَلیب شیدا را
به خُلق و لطف توان کرد صید اهل نظر
به بند و دام نگیرند مرغ دانا را
ندانم از چه سبب رنگ آشنایی نیست
سَهی‌ قدانِ سیَه‌ چشمِ ماه‌ سیما را
چو با حبیب نشینی و باده پیمایی
به یاد دار مُحِبّان بادپیما را
جز این قَدَر نتوان گفت در جمال تو عیب
که وضع مِهر و وفا نیست روی زیبا را
در آسمان نه عجب گر به گفتهٔ حافظ
سرود زُهره به رقص آورد مسیحا را
""",

"غزل۵" : """دل می‌رود ز دستم صاحب‌دلان خدا را
دردا که راز پنهان خواهد شد آشکارا
کشتی‌شکستگانیم ای باد شُرطِه برخیز
باشد که باز بینم دیدار آشنا را
ده‌روزه مِهر گردون، افسانه است و افسون
نیکی به جای یاران فرصت شمار یارا
در حلقهٔ گل‌ و مُل خوش خواند دوش بلبل
هاتِ الصَّبُوحَ هُبّوا یا ایُّها السُکارا
ای صاحب کرامت شکرانهٔ سلامت
روزی تَفَقُّدی کن درویش بی‌نوا را
آسایش دو گیتی تفسیر این دو حرف است
با دوستان مروت با دشمنان مدارا
در کوی نیک‌نامی ما را گذر ندادند
گر تو نمی‌پسندی تغییر کن قضا را
آن تلخ‌وَش که صوفی ام‌ُّالخَبائِثَش خواند
اَشهی لَنا و اَحلی مِن قُبلَةِ العَذارا
هنگام تنگ‌دستی در عیش کوش و مستی
کاین کیمیای هستی قارون کُنَد گدا را
سرکش مشو که چون شمع از غیرتت بسوزد
دلبر که در کف او موم است سنگ خارا
آیینهٔ سکندر، جام می است بنگر
تا بر تو عرضه دارد احوال مُلک دارا
خوبان پارسی‌گو، بخشندگان عمرند
ساقی بده بشارت رندان پارسا را
حافظ به خود نپوشید این خرقهٔ مِی‌ْآلود
ای شیخ پاک‌دامن معذور دار ما را
""",

"غزل۶" : """به ملازمان سلطان که رساند این دعا را؟
که به شُکرِ پادشاهی ز نظر مران گدا را
ز رقیب دیوسیرت به خدای خود پناهم
مگر آن شهاب ثاقب مددی دهد خدا را
مژهٔ سیاهت ار کرد به خون ما اشارت
ز فریب او بیندیش و غلط مکن نگارا
دل عالمی بسوزی چو عِذار برفُروزی
تو از این چه سود داری که نمی‌کنی مدارا
همه شب در این امیدم که نسیم صبحگاهی
به پیام آشنایان بنوازد آشنا را
چه قیامت است جانا که به عاشقان نمودی؟
دل و جان فدای رویت بنما عِذار ما را
به خدا که جرعه‌ای ده تو به حافظ سحرخیز
که دعای صبحگاهی اثری کند شما را
""",

"غزل۷" : """صوفی بیا که آینه صافیست جام را
تا بنگری صفای می لعل‌فام را
راز درون پرده ز رندان مست پرس
کاین حال نیست زاهد عالی‌مقام را
عَنقا شکار کَس نشود دام بازچین
کآنجا همیشه باد به دست است، دام را
در بزم دور، یک‌دو قدح درکش و برو
یعنی طمع مدار وصال دوام را
ای دل شباب رفت و نچیدی گلی ز عیش
پیرانه‌سر مکن هنری ننگ و نام را
در عیش نقد کوش که چون آبخور نماند
آدمْ بهشتْ، روضهٔ دارُالسَلام را
ما را بر آستان تو بس حق خدمت است
ای خواجه بازبین به تَرَحُّم غلام را
حافظ مرید جام می است ای صبا برو
وز بنده بندگی برسان شیخ جام را
""",

"غزل۸" : """ساقیا برخیز و دَردِه جام را
خاک بر سر کن غم ایام را
ساغر می بر کفم نِه تا ز بَر
بَرکِشم این دلق اَزرَق‌فام را
گر چه بدنامی‌ست نزد عاقلان
ما نمی‌خواهیم ننگ و نام را
باده دَردِه چند از این باد غرور
خاک بر سر نفس نافرجام را
دود آه سینهٔ نالان من
سوخت این افسردگان خام را
محرم راز دل شیدای خود
کس نمی‌بینم ز خاص و عام را
با دلارامی مرا خاطر خوش است
کز دلم یک باره بُرد آرام را
ننگرد دیگر به سرو اندر چمن
هرکه دید آن سرو سیم‌اندام را
صبر کن حافظ به سختی روز و شب
عاقبت روزی بیابی کام را
""",

"غزل۹" : """رونق عهد شباب است دگر بُستان را
می‌رسد مژدهٔ گل بلبل خوش الحان را
ای صبا گر به جوانان چمن باز رَسی
خدمت ما برسان سرو و گل و ریحان را
گر چنین جلوه کند مغبچهٔ باده فروش
خاک‌روب در میخانه کنم مژگان را
ای که بر مه کشی از عَنبر سارا چوگان
مضطرب حال مگردان، من سرگردان را
ترسم این قوم که بر دُردکشان می‌خندند
در سر کار خرابات کنند ایمان را
یار مردان خدا باش که در کشتی نوح
هست خاکی که به آبی نخرد طوفان را
برو از خانهٔ گردون به در و نان مطلب
کان سیه کاسه در آخر بِکُشد مهمان را
هر که را خوابگه آخر مشتی خاک است
گو چه حاجت که به افلاک کشی ایوان را
ماه کنعانی من! مسند مصر آنِ تو شد
وقت آن است که بدرود کنی زندان را
حافظا می خور و رندی کن و خوش باش ولی
دام تزویر مکن چون دگران قرآن را
""",

"غزل۱۰" : """دوش از مسجد سوی میخانه آمد پیر ما
چیست یاران طریقت بعد از این تدبیر ما
ما مریدان روی سوی قبله چون آریم چون
روی سوی خانهٔ خَمّار دارد پیر ما
در خرابات طریقت ما به هم منزل شویم
کاین چنین رفته‌ست در عهد ازل تقدیر ما
عقل اگر داند که دل در بند زلفش چون خوش است
عاقلان دیوانه گردند از پی زنجیر ما
روی خوبت آیتی از لطف بر ما کشف کرد
زان زمان جز لطف و خوبی نیست در تفسیر ما
با دل سنگینت آیا هیچ درگیرد شبی؟
آه آتشناک و سوز سینهٔ شبگیر ما
تیر آه ما ز گردون بگذرد حافظ خموش
رحم کن بر جان خود پرهیز کن از تیر ما
""",

"غزل۱۱" : """ساقی به نور باده برافروز جامِ ما
مطرب بگو که کارِ جهان شُد به کامِ ما
ما در پیاله عکس رخ یار دیده‌ایم
ای بی‌خبر ز لذتِ شربِ مدامِ ما
هرگز نمیرد آن که دلش زنده شد به عشق
ثبت است بر جریدهٔ عالم دوام ما
چندان بُوَد کرشمه و نازِ سَهی‌قدان
کآید به جلوه سرو صنوبرخرام ما
ای باد اگر به گلشن اَحباب بگذری
زنهار عرضه دِه بَرِ جانان پیام ما
گو نام ما ز یاد به عمداً چه می‌بری؟!
خود آید آن که یاد نیاری ز نام ما
مستی به چشمِ شاهدِ دلبندِ ما خوش است
زآن رو سپرده‌اند به مستی زمام ما
ترسم که صرفه‌ای نَبَرَد روز بازخواست
نانِ حلالِ شیخ، ز آب حرام ما
حافظ ز دیده، دانهٔ اشکی همی‌فشان
باشد که مرغِ وصل کُند قصدِ دام ما
دریای اخضر فلک و کشتی هلال
هستند غرق نعمت حاجی‌قوام ما
""",

"غزل۱۲" : """ای فروغِ ماهِ حُسن، از روی رخشان شما
آبروی خوبی از چاه زَنَخدان شما
عزم دیدار تو دارد جانِ بر لب آمده
باز گردد یا برآید؟ چیست فرمان شما؟
کَس به دور نرگست طرفی نبست از عافیت
بِه که نفروشند مستوری به مستان شما
بخت خواب آلود ما بیدار خواهد شد مگر
زان که زد بر دیده آبی، روی رخشان شما
با صبا همراه بفرست از رخت گل دسته‌ای
بو که بویی بشنویم از خاک بستان شما
عمرتان باد و مراد ای ساقیانِ بزمِ جم
گر چه جام ما نشد پُر مِی به دوران شما
دل خرابی می‌کند، دلدار را آگه کنید
زینهار ای دوستان جان من و جان شما
کی دهد دست این غرض یا رب که همدستان شوند
خاطر مجموع ما، زلف پریشان شما
دور دار از خاک و خون دامن، چو بر ما بگذری
کاندر این ره کشته بسیارند، قربان شما
می‌کند حافظ دعایی، بشنو، آمینی بگو
روزی ما باد لعل شَکَّرافشان شما
ای صبا با ساکنانِ شهرِ یزد از ما بگو
کای سر حق ناشناسان گوی چوگان شما
گر چه دوریم از بساط قرب، همت دور نیست
بندهٔ شاه شماییم و ثناخوان شما
ای شَهنشاه بلند اختر، خدا را همتی
تا ببوسم همچو اختر خاک ایوان شما
""",

"غزل۱۳" : """می‌دمد صبح و کِلِّه بست سحاب
الصَبوح الصَبوح یا اصحاب
می‌چکد ژاله بر رخِ لاله
المُدام المُدام یا احباب
می‌وزد از چمن نسیمِ بهشت
هان، بنوشید دَم به دَم مِیِ ناب
تخت زُمْرُد زده است گل به چمن
راحِ چون لعلِ آتشین دریاب
درِ میخانه بسته‌اند دگر
اِفتَتِح یا مُفَتِّح الاَبواب
لب و دَندانْت را حقوق نمک
هست بر جان و سینه‌هایِ کباب
این چنین موسمی عجب باشد
که ببندند میکده به شتاب
بر رخِ ساقی پری پیکر
همچو حافظ بنوش بادهٔ ناب
""",

"غزل۱۴" : """گفتم ای سلطانِ خوبان رحم کن بر این غریب
گفت در دنبالِ دل، رَه گُم کُنَد مسکین غریب
گفتمش مَگذر زمانی، گفت معذورم بدار
خانه پروردی، چه تاب آرد غم چندین غریب
خفته بر سنجابِ شاهی نازنینی را چه غم؟
گر ز خار و خاره سازد بستر و بالین غریب
ای که در زنجیرِ زلفت جایِ چندین آشناست
خوش فتاد آن خالِ مشکین بر رخِ رنگین غریب
می‌نماید عکسِ مِی، در رنگِ رویِ مَه وَشَت
همچو برگِ ارغوان بر صفحهٔ نسرین، غریب
بس غریب افتاده است آن مور خَط، گِردِ رُخَت
گر چه نَبوَد در نگارستان، خطِ مشکین غریب
گفتم ای شامِ غریبان طُرِّهٔ شبرنگِ تو
در سحرگاهان حذر کن، چون بنالد این غریب
گفت حافظ آشنایان در مقامِ حیرتند
دور نَبوَد گر نشیند خسته و مسکین غریب
""",

"غزل۱۵" : """ای شاهد قدسی، کِه کَشَد بند نقابت؟
وی مرغ بهشتی، که دهد دانه و آبت؟
خوابم بشد از دیده در این فکر جگرسوز
کآغوش که شد، منزل آسایش و خوابت؟
درویش نمی‌پرسی و ترسم که نباشد
اندیشهٔ آمرزش و پروای ثوابت
راه دل عشاق زد آن چشم خماری
پیداست از این شیوه که مست است شرابت
تیری که زدی بر دلم از غمزه، خطا رفت
تا باز چه اندیشه کند رای صوابت
هر ناله و فریاد که کردم نشنیدی
پیداست نگارا که بلند است جَنابت
دور است سر آب از این بادیه، هش دار
تا غول بیابان نفریبد به سرابت
تا در ره پیری به چه آیین رَوی ای دل
باری به غلط صرف شد ایام شبابت
ای قصرِ دل افروز که منزلگه انسی
یا رب مَکُناد آفت ایام خرابت
حافظ نه غلامیست که از خواجه گریزد
صلحی کن و بازآ که خرابم ز عِتابت
""",

"غزل۱۶" : """خَمی که ابروی شوخِ تو در کمان انداخت
به قصد جانِ منِ زارِ ناتوان انداخت
نبود نقش دو عالم، که رنگ الفت بود
زمانه طرح محبت، نه این زمان انداخت
به یک کرشمه که نرگس به خودفروشی کرد
فریبِ چشمِ تو صد فتنه در جهان انداخت
شراب خورده و خِوی کرده می‌روی به چمن
که آبِ روی تو، آتش در ارغوان انداخت
به بزمگاهِ چمن دوش مست بگذشتم
چو از دهانِ توام غنچه در گمان انداخت
بنفشه طُرِّه مفتول خود گره می‌زد
صبا حکایتِ زلفِ تو در میان انداخت
ز شرمِ آن که به روی تو نسبتش کردم
سمن به دستِ صبا، خاک در دهان انداخت
من از ورع، مِی و مطرب ندیدمی زین پیش
هوای مغبچگانم در این و آن انداخت
کنون به آبِ مِی لعل، خرقه می‌شویم
نصیبهٔ ازل از خود، نمی‌توان انداخت
مگر گشایش حافظ در این خرابی بود؟
که بخششِ ازلش، در می مغان انداخت
جهان به کامِ من اکنون شود، که دور زمان
مرا به بندگیِ خواجهٔ جهان انداخت
""",

"غزل۱۷" : """سینه از آتش دل، در غم جانانه بسوخت
آتشی بود در این خانه، که کاشانه بسوخت
تنم از واسطهٔ دوری دلبر بگداخت
جانم از آتشِ مهرِ رخِ جانانه بسوخت
سوز دل بین که ز بس آتش اشکم، دل شمع
دوش بر من ز سر مِهر، چو پروانه بسوخت
آشنایی نه غریب است، که دلسوز من است
چون من از خویش برفتم، دل بیگانه بسوخت
خرقهٔ زهدِ مرا، آب خرابات ببرد
خانهٔ عقلِ مرا، آتش میخانه بسوخت
چون پیاله دلم از توبه که کردم بشکست
همچو لاله، جگرم بی می و خُمخانه بسوخت
ماجرا کم کن و بازآ که مرا مردم چشم
خرقه از سر به درآورد و به شکرانه بسوخت
ترک افسانه بگو حافظ و می نوش دمی
که نَخُفتیم شب و شمع به افسانه بسوخت
""",

"غزل۱۸" : """ساقیا آمدنِ عید، مبارک بادت
وان مَواعید که کردی، مَرَواد از یادت
در شگفتم که در این مدتِ ایامِ فراق
برگرفتی ز حریفان دل و دل می‌دادت
برسان بندگیِ دختر رَز، گو به درآی
که دَمُ و همت ما کرد ز بند آزادت
شادی مجلسیان در قدم و مقدم توست
جای غم باد، مَر آن دل، که نخواهد شادت
شکر ایزد که ز تاراجِ خزان رخنه نیافت
بوستان سمن و سرو و گل و شمشادت
چشم بد دور کز آن تفرقه‌ات بازآورد
طالع نامور و دولت مادرزادت
حافظ از دست مده دولت این کشتی نوح
ور نه طوفانِ حوادث بِبَرَد بُنیادت
""",

"غزل۱۹" : """ای نسیم سحر آرامگَهِ یار کجاست؟
منزلِ آن مَهِ عاشق‌کُشِ عیار کجاست؟
شبِ تار است و رَه وادیِ اِیمن در پیش
آتش طور کجا؟ موعد دیدار کجاست؟
هر که آمد به جهان نقش خرابی دارد
در خرابات بگویید که هشیار کجاست؟
آن کَس است اهل بشارت که اشارت داند
نکته‌ها هست بسی محرم اسرار کجاست؟
هر سرِ مویِ مرا با تو هزاران کار است
ما کجاییم و ملامت‌گر بی‌کار کجاست؟
باز پرسید ز گیسویِ شِکَن در شِکَنَش
کاین دل غم‌زده، سرگشته گرفتار، کجاست؟
عقل دیوانه شد آن سلسله مشکین کو؟
دل ز ما گوشه گرفت ابروی دلدار کجاست؟
ساقی و مطرب و می جمله مهیاست ولی
عیش، بی یار مهیا نشود یار کجاست؟
حافظ از بادِ خزان، در چمنِ دهر مَرَنج
فکرِ معقول بفرما، گلِ بی خار کجاست؟
""",

"غزل۲۰" : """روزه یک سو شد و عید آمد و دل‌ها برخاست
می ز خُمخانه به جوش آمد و می‌باید خواست
نوبهٔ زهدفروشانِ گران جان بگذشت
وقتِ رندی و طرب کردن رندان پیداست
چه ملامت بود آن را که چنین باده خورَد؟
این چه عیب است بدین بی‌خردی، وین چه خطاست؟
باده نوشی که در او روی و ریایی نَبُوَد
بهتر از زهدفروشی، که در او روی و ریاست
ما نه رندان ریاییم و حریفان نفاق
آن که او عالِم سِرّ است، بدین حال گواست
فرض ایزد بگزاریم و به کس بد نکنیم
وان چه گویند روا نیست، نگوییم رواست
چه شود گر من و تو چند قدح باده خوریم؟
باده از خون رَزان است، نه از خون شماست
این چه عیب است کز آن عیب خلل خواهد بود
ور بُوَد نیز چه شد؟ مردم بی‌عیب کجاست
""",

"غزل۲۱" : """دل و دینم شد و دلبر به ملامت برخاست
گفت با ما منشین کز تو سلامت برخاست
که شنیدی که در این بزم دمی خوش بنشست
که نه در آخر صحبت به ندامت برخاست
شمع اگر زان لب خندان به زبان لافی زد
پیش عشاق تو شب‌ها به غرامت برخاست
در چمن باد بهاری ز کنار گل و سرو
به هواداری آن عارض و قامت برخاست
مست بگذشتی و از خلوتیان ملکوت
به تماشای تو آشوب قیامت برخاست
پیش رفتار تو پا برنگرفت از خجلت
سرو سرکش که به ناز از قد و قامت برخاست
حافظ این خرقه بینداز مگر جان ببری
کاتش از خرقه سالوس و کرامت برخاست
""",

"غزل۲۲" : """چو بشنوی سخن اهل دل مگو که خطاست
سخن شناس نه‌ای جان من، خطا این جاست
سرم به دنیی و عقبی فرو نمی‌آید
تبارک الله از این فتنه‌ها که در سر ماست
در اندرون من خسته دل ندانم کیست
که من خموشم و او در فغان و در غوغاست
دلم ز پرده برون شد کجایی ای مطرب
بنال، هان که از این پرده کار ما به نواست
مرا به کار جهان هرگز التفات نبود
رخ تو در نظر من چنین خوشش آراست
نخفته‌ام ز خیالی که می‌پزد دل من
خمار صدشبه دارم شرابخانه کجاست
چنین که صومعه آلوده شد ز خون دلم
گرم به باده بشویید حق به دست شماست
از آن به دیرِ مغانم عزیز می‌دارند
که آتشی که نمیرد همیشه در دل ماست
چه ساز بود که در پرده می‌زد آن مطرب
که رفت عمر و هنوزم دِماغ پُر ز هواست
ندای عشق تو دیشب در اندرون دادند
فضای سینه حافظ هنوز پر ز صداست
""",

"غزل۲۳" : """خیالِ رویِ تو در هر طریق همره ماست
نسیم موی تو پیوندِ جانِ آگه ماست
به رغم مدعیانی که منع عشق کنند
جمالِ چهرهٔ تو حجت موجه ماست
ببین که سیب زنخدان تو چه می‌گوید
هزار یوسف مصری فتاده در چَهِ ماست
اگر به زلف دراز تو دست ما نرسد
گناه بخت پریشان و دست کوته ماست
به حاجبِ درِ خلوت سرایِ خاص بگو
فُلان ز گوشه نشینانِ خاکِ درگهِ ماست
به صورت از نظر ما اگر چه محجوب است
همیشه در نظرِ خاطرِ مرفهِ ماست
اگر به سالی حافظ دری زند بگشای
که سال‌هاست که مشتاق روی چون مه ماست
""",

"غزل۲۴" : """مطلب طاعت و پیمان و صلاح از منِ مست
که به پیمانه کشی شهره شدم روز الست
من همان دم که وضو ساختم از چشمه عشق
چارتکبیر زدم یکسره بر هر چه که هست
می بده تا دهمت آگهی از سِرِّ قضا
که به رویِ که شدم عاشق و از بوی که مست
کمر کوه کم است از کمر مور این جا
ناامید از در رحمت مشو ای باده پرست
به جز آن نرگس مستانه که چشمش مَرِساد
زیر این طارِم فیروزه کسی خوش ننشست
جان فدای دهنش باد که در باغ نظر
چمن آرای جهان خوشتر از این غنچه نبست
حافظ از دولت عشق تو سلیمانی شد
یعنی از وصل تواش نیست به جز باد به دست
""",

"غزل۲۵" : """شکفته شد گل حَمرا و گشت بلبل مست
صلایِ سرخوشی، ای صوفیان باده پرست
اساس توبه که در محکمی چو سنگ نمود
ببین که جام زُجاجی چه طُرفه‌اش بشکست
بیار باده که در بارگاه استغنا
چه پاسبان و چه سلطان، چه هوشیار و چه مست
از این رِباط دودر، چون ضرورت است رَحیل
رِواق و طاقِ معیشت، چه سربلند و چه پست
مقام عیش میسر نمی‌شود بی‌رنج
بلی به حکم بلا بسته‌اند عهد الست
به هست و نیست مرنجان ضمیر و خوش می‌باش
که نیستی است سرانجام هر کمال که هست
شکوه آصفی و اسب باد و منطق طیر
به باد رفت و از او خواجه هیچ طَرف نبست
به بال و پَر مرو از ره که تیر پرتابی
هوا گرفت زمانی، ولی به خاک نشست
زبان کِلکِ تو حافظ چه شکر آن گوید
که گفتهٔ سخنت می‌برند دست به دست
""",

"غزل۲۶" : """زلف‌آشفته و خِوی‌کرده و خندان‌لب و مست
پیرهن‌چاک و غزل‌خوان و صُراحی در دست
نرگسش عربده‌جوی و لبش افسوس‌کنان
نیم شب دوش به بالین من آمد بنشست
سر فرا گوش من آورد به آواز حزین
گفت ای عاشق دیرینهٔ من خوابت هست؟
عاشقی را که چنین بادهٔ شبگیر دهند
کافر عشق بود گر نشود باده پرست
برو ای زاهد و بر دُردکشان خرده مگیر
که ندادند جز این تحفه به ما روز الست
آن چه او ریخت به پیمانهٔ ما نوشیدیم
اگر از خَمر بهشت است وگر بادهٔ مست
خندهٔ جامِ می و زلفِ گره‌گیر نگار
ای بسا توبه که چون توبه حافظ بشکست
""",

"غزل۲۷" : """در دیر مغان آمد، یارم قدحی در دست
مست از می و میخواران از نرگس مستش مست
در نعلِ سمندِ او شکلِ مهِ نو پیدا
وز قدِ بلندِ او بالای صنوبر پست
آخر به چه گویم هست از خود خبرم، چون نیست
وز بهر چه گویم نیست با وی نظرم، چون هست
شمع دل دمسازم، بنشست چو او برخاست
و افغان ز نظربازان، برخاست چو او بنشست
گر غالیه خوش بو شد، در گیسوی او پیچید
ور وَسمه کمانکش گشت، در ابروی او پیوست
بازآی که بازآید عمرِ شدهٔ حافظ
هر چند که ناید باز، تیری که بشد از شست
""",

"غزل۲۸" : """به جانِ خواجه و حقِ قدیم و عهدِ درست
که مونسِ دمِ صبحم، دعای دولت توست
سرشک من که ز طوفان نوح دست بَرَد
ز لوح سینه نیارَست نقشِ مهرِ تو شُست
بکن معامله‌ای، وین دل شکسته بخر
که با شکستگی ارزد به صد هزار درست
زبان مور به آصف دراز گشت و رواست
که خواجه خاتَمِ جم، یاوه کرد و باز نَجُست
دلا طمع مَبر از لطف بی‌نهایت دوست
چو لاف عشق زدی سر بباز، چابک و چُست
به صدق کوش، که خورشید زایَد از نَفَسَت
که از دروغ سیه روی گشت صبحِ نخست
شدم ز دست تو شیدای کوه و دشت و هنوز
نمی‌کنی به ترحم، نِطاق سلسله سست
مرنج حافظ و از دلبران حِفاظ مجوی
گناه باغ چه باشد چو این گیاه نَرُست
""",

"غزل۲۹" : """ما را ز خیال تو چه پروای شراب است؟
خُم گو سر خود گیر، که خُمخانه خراب است
گر خَمر بهشت است بریزید که بی دوست
هر شربت عَذبَم که دهی، عین عذاب است
افسوس که شُد دلبر و در دیدهٔ گریان
تحریرِ خیالِ خطِ او نقشِ بر آب است
بیدار شو ای دیده که ایمن نتوان بود
زین سیل دمادم که در این منزل خواب است
معشوق عیان می‌گذرد بر تو، ولیکن
اغیار همی‌بیند از آن بسته نقاب است
گل بر رخ رنگین تو تا لطف عرق دید
در آتش شوق از غم دل، غرق گلاب است
سبز است در و دشت بیا تا نگذاریم
دست از سر آبی که جهان جمله سراب است
در کُنجِ دِماغم مطلب جای نصیحت
کاین گوشه پر از زمزمهٔ چنگ و رَباب است
حافظ چه شد ار عاشق و رند است و نظرباز
بس طورِ عجب، لازم ایام شباب است
""",

"غزل۳۰" : """زلفت هزار دل به یکی تار مو ببست
راه هزار چاره‌گر از چار سو ببست
تا عاشقان به بوی نسیمش دهند جان
بگشود نافه‌ایُّ و دَرِ آرزو ببست
شیدا از آن شدم که نگارم چو ماه نو
ابرو نمود و جلوه‌گری کرد و رو ببست
ساقی به چند رنگ، می اندر پیاله ریخت
این نقش‌ها نگر، که چه خوش در کدو ببست
یا رب چه غمزه کرد صُراحی که خون خُم
با نعره‌های قُلقُلش اندر گلو ببست
مطرب چه پرده ساخت که در پردهٔ سماع
بر اهل وجد و حال، درِ های و هو ببست
حافظ! هر آن که عشق نَورزید و وصل خواست
احرامِ طوفِ کعبهٔ دل بی وضو ببست
""",

"غزل۳۱" : """آن شبِ قدری که گویند اهل خلوت امشب است
یا رب این تأثیرِ دولت در کدامین کوکب است؟
تا به گیسوی تو دست ناسزایان کم رسد
هر دلی از حلقه‌ای در ذکر یارب یارب است
کشته چاه زنخدان توام کز هر طرف
صد هزارش گردن جان زیرِ طوقِ غبغب است
شهسوار من که مه آیینه دار روی اوست
تاجِ خورشیدِ بلندش خاکِ نعلِ مرکب است
عکس خِوی بر عارضش بین کآفتاب گرم رو
در هوای آن عرق تا هست هر روزش تب است
من نخواهم کرد ترک لعل یار و جام می
زاهدان معذور داریدم که اینم مذهب است
اندر آن ساعت که بر پشت صبا بندند زین
با سلیمان چون برانم من که مورم مرکب است
آن که ناوک بر دل من زیر چشمی می‌زند
قوتِ جانِ حافظش در خندهٔ زیر لب است
آب حیوانش ز منقار بلاغت می‌چکد
زاغِ کِلکِ من به نام ایزد چه عالی مشرب است
""",

"غزل۳۲" : """خدا چو صورتِ ابرویِ دلگشای تو بست
گشادِ کارِ من اندر کرشمه‌های تو بست
مرا و سرو چمن را به خاک راه نشاند
زمانه تا قَصَبِ نرگس قبای تو بست
ز کار ما و دل غنچه صد گره بگشود
نسیم گل چو دل اندر پی هوای تو بست
مرا به بندِ تو دوران چرخ راضی کرد
ولی چه سود که سررشته در رضای تو بست
چو نافه بر دلِ مسکینِ من گره مفکن
که عهد با سرِ زلفِ گره گشای تو بست
تو خود وصالِ دگر بودی ای نسیم وصال
خطا نگر، که دل امید در وفای تو بست
ز دستِ جورِ تو گفتم ز شهر خواهم رفت
به خنده گفت: که حافظ برو، که پای تو بست؟
""",

"غزل۳۳" : """خلوت گُزیده را به تماشا چه حاجت است
چون کوی دوست هست به صحرا چه حاجت است
جانا به حاجتی که تو را هست با خدا
کآخِر دمی بپرس که ما را چه حاجت است
ای پادشاهِ حُسن خدا را بسوختیم
آخِر سؤال کن که گدا را چه حاجت است
اربابِ حاجتیم و زبان سؤال نیست
در حضرت کریم، تمنا چه حاجت است
محتاج قصه نیست گرت قصدِ خون ماست
چون رخت از آن توست، به یغما چه حاجت است
جامِ جهان نماست ضمیرِ منیرِ دوست
اظهار احتیاج، خود آن جا چه حاجت است
آن شد که بارِ منتِ مَلّاح بردمی
گوهر چو دست داد به دریا چه حاجت است
ای مدعی برو که مرا با تو کار نیست
احباب حاضرند، به اعدا چه حاجت است
ای عاشقِ گدا چو لبِ روح بخش یار
می‌داندت وظیفه، تقاضا چه حاجت است
حافظ! تو ختم کن که هنر خود عیان شود
با مدعی نزاع و مُحاکا چه حاجت است
""",

"غزل۳۴" : """رَواقِ منظرِ چشمِ من آشیانهٔ توست
کَرَم نما و فرود آ که خانه خانهٔ توست
به لطفِ خال و خط از عارفان ربودی دل
لطیفه‌های عجب زیرِ دام و دانهٔ توست
دلت به وصلِ گل ای بلبل صبا خوش باد
که در چمن همه گلبانگ عاشقانهٔ توست
عِلاج ضعفِ دلِ ما به لب حوالت کن
که این مُفَرِّحِ یاقوت، در خزانهٔ توست
به تن مُقصرم از دولتِ ملازمتت
ولی خلاصهٔ جان خاکِ آستانهٔ توست
من آن نِیَم که دهم نقدِ دل به هر شوخی
دَرِ خزانه، به مهر تو و نشانهٔ توست
تو خود چه لعبتی ای شهسوارِ شیرین کار
که توسنی چو فلک، رامِ تازیانهٔ توست
چه جای من، که بلغزد سپهر شعبده باز
از این حیَل که در انبانهٔ بهانهٔ توست
سرودِ مجلست اکنون فلک به رقص آرد
که شعرِ حافظِ شیرین سخن ترانهٔ توست
""",

"غزل۳۵" : """برو به کارِ خود ای واعظ این چه فریادست
مرا فتاد دل از ره، تو را چه افتادست؟
میان او که خدا آفریده است از هیچ
دقیقه‌ایست که هیچ آفریده نگشادست
به کام تا نرساند مرا لبش چون نای
نصیحتِ همه عالم به گوش من بادست
گدای کوی تو از هشت خُلد مستغنیست
اسیرِ عشقِ تو از هر دو عالم آزادست
اگر چه مستی عشقم خراب کرد ولی
اساسِ هستیِ من زان خراب آبادست
دلا منال ز بیداد و جور یار که یار
تو را نصیب همین کرد و این از آن دادست
برو فِسانه مخوان و فسون مدم حافظ
کز این فسانه و افسون مرا بسی یادست
""",

"غزل۳۶" : """تا سرِ زلفِ تو در دست نسیم افتادست
دلِ سودازده از غصه دو نیم افتادست
چَشمِ جادویِ تو خود عینِ سَوادِ سحْر است
لیکن این هست که این نسخه سَقیم افتادست
در خَم زلف تو آن خال سیه دانی چیست؟
نقطهٔ دوده که در حلقه جیم افتادست
زلف مِشکین تو در گلشن فردوسِ عِذار
چیست؟ طاووس که در باغ نعیم افتادست
دلِ من در هوسِ رویِ تو ای مونس جان
خاکِ راهیست که در دستِ نسیم افتادست
همچو گَرد این تنِ خاکی نتوانَد برخاست
از سرِ کویِ تو زان رو که عظیم افتادست
سایهٔ قَدِّ تو بر قالبم ای عیسی دم
عکسِ روحیست که بر عَظمِ رَمیم افتادست
آن که جز کعبه مقامش نَبُد از یادِ لبت
بر درِ میکده دیدم که مقیم افتادست!
حافظِ گمشده را با غمت ای یارِ عزیز
اتحادیست که در عهد قدیم افتادست
""",

"غزل۳۷" : """بیا که قصرِ اَمَل سخت سست بنیادست
بیار باده که بنیادِ عمر بر بادست
غلامِ همتِ آنم که زیرِ چرخِ کبود
ز هر چه رنگِ تعلق پذیرد آزادست
چه گویمت که به میخانه دوش مست و خراب
سروشِ عالَمِ غیبم چه مژده‌ها دادست
که ای بلندنظر شاهبازِ سِدره نشین
نشیمن تو نه این کُنجِ محنت آبادست
تو را ز کنگرهٔ عرش می‌زنند صفیر
ندانمت که در این دامگه چه افتادست
نصیحتی کنمت یاد گیر و در عمل آر
که این حدیث، ز پیرِ طریقتم یادست
غمِ جهان مخور و پندِ من مَبَر از یاد
که این لطیفهٔ عشقم ز رهروی یادست
رضا به داده بده، وز جبین گره بگشای
که بر من و تو دَرِ اختیار نگشادست
مجو درستیِ عهد از جهانِ سست نهاد
که این عجوز، عروس هزاردامادست
نشان عهد و وفا نیست در تبسمِ گل
بنال بلبل بی دل که جای فریادست
حسد چه می‌بری ای سست نظم بر حافظ؟
قبولِ خاطر و لطفِ سخن خدادادست
""",

"غزل۳۸" : """بی مهرِ رُخَت روزِ مرا نور نماندست
وز عمر، مرا جز شبِ دیجور نماندست
هنگامِ وداعِ تو ز بس گریه که کردم
دور از رخِ تو چشمِ مرا نور نماندست
می‌رفت خیالِ تو ز چشمِ من و می‌گفت
هیهات از این گوشه که معمور نماندست
وصلِ تو اجل را ز سرم دور همی‌داشت
از دولتِ هجرِ تو کنون دور نماندست
نزدیک شد آن دم که رقیب تو بگوید
دور از رُخَت این خستهٔ رنجور نماندست
صبر است مرا چارهٔ هجرانِ تو لیکن
چون صبر توان کرد؟ که مقدور نماندست
در هجرِ تو گر چشمِ مرا آبِ روان است
گو خونِ جگر ریز که معذور نماندست
حافظ، ز غم از گریه نپرداخت به خنده
ماتم زده را داعیهٔ سور نماندست
""",

"غزل۳۹" : """باغِ مرا چه حاجتِ سرو و صنوبر است؟
شمشادِ خانه‌پرورِ ما از که کمتر است؟
ای نازنین‌پسر، تو چه مذهب گرفته‌ای؟
کِت خونِ ما حلال‌تر از شیرِ مادر است
چون نقشِ غم ز دور ببینی شراب خواه
تشخیص کرده‌ایم و مداوا مقرّر است
از آستانِ پیرِ مغان سر چرا کشیم؟
دولت در آن سرا و گشایش در آن در است
یک قصّه بیش نیست غمِ عشق، وین عجب
کز هر زبان که می‌شنوم نامکرّر است
دی وعده داد وصلم و در سر شراب داشت
امروز تا چه گوید و بازش چه در سر است
شیراز و آبِ رکنی و این بادِ خوش نسیم
عیبش مکن که خالِ رُخِ هفت کشور است
فرق است از آبِ خضر که ظلمات جای او است
تا آبِ ما که منبعش الله اکبر است
ما آبرویِ فقر و قناعت نمی‌بریم
با پادشه بگوی که روزی مقدّر است
حافظ چه طُرفه شاخ نباتیست کِلکِ تو
کِش میوه دلپذیرتر از شهد و شکّر است
""",

"غزل۴۰" : """اَلمِنَّةُ لِلَّه که درِ میکده باز است
زان رو که مرا بر در او روی نیاز است
خُم‌ها همه در جوش و خروشند ز مستی
وان می که در آن جاست حقیقت، نه مجاز است
از وی همه مستی و غرور است و تکبر
وز ما همه بیچارگی و عجز و نیاز است
رازی که بَرِ غیر نگفتیم و نگوییم
با دوست بگوییم که او محرم راز است
شرحِ شِکَنِ زلفِ خَم اندر خَم جانان
کوته نتوان کرد که این قصه دراز است
بارِ دلِ مجنون و خَمِ طُرِّهٔ لیلی
رخسارهٔ محمود و کفِ پایِ ایاز است
بردوخته‌ام دیده چو باز از همه عالم
تا دیدهٔ من بر رُخِ زیبایِ تو باز است
در کعبهٔ کوی تو هر آن کس که بیاید
از قبلهٔ ابروی تو در عینِ نماز است
ای مجلسیان، سوزِ دلِ حافظِ مسکین
از شمع بپرسید که در سوز و گداز است
""",

"غزل۴۱" : """اگر چه باده فرح بخش و باد گل‌بیز است
به بانگ چنگ مخور می که محتسب تیز است
صراحی‌ای و حریفی گرت به چنگ افتد
به عقل نوش که ایام فتنه‌ انگیز است
در آستین مرقع پیاله پنهان کن
که همچو چشم صراحی زمانه خونریز است
به آب دیده بشوییم خرقه‌ها از می
که موسم ورع و روزگار پرهیز است
مجوی عیش خوش از دور باژگون سپهر
که صاف این سر خم جمله دُردی آمیز است
سپهرِ بر شده پرویزنی‌ست خون افشان
که ریزه‌اش سر کسری و تاجِ پرویز است
عراق و فارس گرفتی به شعر خوش حافظ
بیا که نوبت بغداد و وقت تبریز است
""",

"غزل۴۲" : """حالِ دل با تو گفتنم هوس است
خبرِ دل شِنُفتَنَم هوس است
طمعِ خام بین که قصهٔ فاش
از رقیبان نهفتنم هوس است
شبِ قدری چنین عزیزِ شریف
با تو تا روز خُفتنم هوس است
وه که دُردانه‌ای چنین نازک
در شبِ تار سُفتنم هوس است
ای صبا امشبم مدد فرمای
که سحرگه شکفتنم هوس است
از برای شرف به نوُکِ مژه
خاکِ راهِ تو رفتنم هوس است
همچو حافظ به رغمِ مدعیان
شعرِ رندانه گفتنم هوس است
""",

"غزل۴۳" : """صحنِ بُستان ذوق بخش و صحبتِ یاران خوش است
وقت گل خوش باد کز وی وقتِ میخواران خوش است
از صبا هر دم مشامِ جانِ ما خوش می‌شود
آری آری طیبِ انفاسِ هواداران خوش است
ناگشوده گل نقاب، آهنگِ رحلت ساز کرد
ناله کن بلبل، که گلبانگِ دل افکاران خوش است
مرغِ خوشخوان را بشارت باد کاندر راهِ عشق
دوست را با نالهٔ شب‌های بیداران خوش است
نیست در بازارِ عالَم خوشدلی ور زان که هست
شیوهٔ رندی و خوش باشیِ عیاران خوش است
از زبانِ سوسنِ آزاده‌ام آمد به گوش
کاندر این دیرِ کهن، کارِ سبکباران خوش است
حافظا! تَرکِ جهان گفتن طریقِ خوشدلیست
تا نپنداری که احوالِ جهان داران خوش است
""",

"غزل۴۴" : """کنون که بر کفِ گل جامِ بادهٔ صاف است
به صدهزار زبان بلبلش در اوصاف است
بخواه دفتر اشعار و راهِ صحرا گیر
چه وقتِ مدرسه و بحث کشف کَشّاف است؟
فقیه مدرسه دی مست بود و فتوی داد
که می حرام، ولی بِه ز مالِ اوقاف است
به دُرد و صاف تو را حکم نیست خوش دَرکَش
که هر چه ساقی ما کرد عینِ الطاف است
بِبُر ز خلق و چو عَنقا قیاس کار بگیر
که صیت گوشه‌نشینان ز قاف تا قاف است
حدیثِ مدّعیان و خیالِ همکاران
همان حکایت زردوز و بوریاباف است
خموش حافظ و این نکته‌های چون زر سرخ
نگاه‌دار که قَلّابِ شهر، صرّاف است
""",

"غزل۴۵" : """در این زمانه رفیقی که خالی از خِلَل است
صُراحیِ میِ ناب و سفینهٔ غزل است
جریده رو، که گذرگاهِ عافیت تنگ است
پیاله گیر، که عمرِ عزیز بی‌بدل است
نه من ز بی‌عملی در جهان ملولم و بس
ملالتِ عُلما هم ز علمِ بی‌عمل است
به چشمِ عقل در این رهگذار پرآشوب
جهان و کار جهان بی‌ثبات و بی‌محل است
بگیر طُرِّهٔ مه‌چهره‌ای و قصّه مخوان
که سعد و نحس ز تأثیر زهره و زحل است
دلم امید فراوان به وصلِ رویِ تو داشت
ولی اجل به رَهِ عمر رهزن امل است
به هیچ دور نخواهند یافت هشیارش
چنین که حافظ ما مستِ بادهٔ ازل است
""",

"غزل۴۶" : """گل در بر و می در کف و معشوق به کام است
سلطانِ جهانم به چنین روز غلام است
گو شمع میارید در این جمع که امشب
در مجلس ما ماهِ رخِ دوست تمام است
در مذهبِ ما باده حلال است ولیکن
بی‌روی تو ای سرو گل‌اندام حرام است
گوشم همه بر قولِ نی و نغمهٔ چنگ است
چشمم همه بر لعلِ لب و گردش جام است
در مجلسِ ما عطر میامیز که ما را
هر لحظه ز گیسوی تو خوش بوی مشام است
از چاشنی قند مگو هیچ و زِ شِکَّر
زان رو که مرا از لبِ شیرینِ تو کام است
تا گنجِ غمت در دلِ ویرانه مقیم است
همواره مرا کوی خرابات مقام است
از ننگ چه گویی که مرا نام ز ننگ است
وز نام چه پرسی که مرا ننگ ز نام است
مِی‌خواره و سرگشته و رندیم و نظرباز
وان کس که چو ما نیست در این شهر کدام است؟
با محتسبم عیب مگویید که او نیز
پیوسته چو ما در طلبِ عیشِ مدام است
حافظ منشین بی‌می و معشوق زمانی
کایّام گل و یاسمن و عید صیام است
""",

"غزل۴۷" : """به کوی میکده هر سالِکی که ره دانست
دری دگر زدن اندیشهٔ تَبَه دانست
زمانه افسر رندی نداد جز به کسی
که سرفرازیِ عالم در این کُلَه دانست
بر آستانهٔ میخانه هر که یافت رهی
ز فیضِ جامِ می اسرار خانقه دانست
هر آن که رازِ دو عالم ز خطِ ساغر خواند
رموزِ جامِ جم از نقشِ خاکِ ره دانست
ورای طاعتِ دیوانگان ز ما مطلب
که شیخِ مذهبِ ما عاقلی گنه دانست
دلم ز نرگسِ ساقی امان نخواست به جان
چرا که شیوهٔ آن تُرک دل سیه، دانست
ز جورِ کوکبِ طالع سحرگهان چشمم
چنان گریست که ناهید دید و مه دانست
حدیثِ حافظ و ساغر که می‌زند پنهان
چه جایِ محتسب و شَحنه، پادشه دانست
بلندمرتبه شاهی که نُه رواق سِپهر
نمونه‌ای ز خَمِ طاقِ بارگه دانست
""",

"غزل۴۸" : """صوفی از پرتو می راز نهانی دانست
گوهر هر کس از این لعل، توانی دانست
قدر مجموعهٔ گل مرغِ سحر داند و بس
که نه هر کو ورقی خواند، معانی دانست
عرضه کردم دو جهان بر دلِ کارافتاده
بجز از عشقِ تو باقی همه فانی دانست
آن شد اکنون که ز ابنای عوام اندیشم
محتسب نیز در این عیشِ نهانی دانست
دلبر آسایش ما مصلحت وقت ندید
ور نه از جانبِ ما دل نگرانی دانست
سنگ و گِل را کُنَد از یُمنِ نظر لعل و عقیق
هر که قدرِ نفسِ بادِ یمانی دانست
ای که از دفترِ عقل آیت عشق آموزی
ترسم این نکته به تحقیق ندانی دانست
می بیاور که ننازد به گلِ باغِ جهان
هر که غارتگریِ بادِ خزانی دانست
حافظ این گوهر منظوم که از طبع انگیخت
ز اثرِ تربیتِ آصفِ ثانی دانست
""",

"غزل۴۹" : """روضهٔ خُلدِ برین خلوت درویشان است
مایهٔ محتشمی خدمتِ درویشان است
گَنج عُزلت که طلسماتِ عجایب دارد
فتحِ آن در نظرِ رحمتِ درویشان است
قصرِ فردوس که رضوانش به دربانی رفت
مَنظَری از چمنِ نُزهَتِ درویشان است
آن چه زر می‌شود از پرتو آن قلبِ سیاه
کیمیاییست که در صحبتِ درویشان است
آن که پیشش بِنَهَد تاجِ تکبر خورشید
کبریاییست که در حشمتِ درویشان است
دولتی را که نباشد غم از آسیبِ زوال
بی تکلف بشنو دولتِ درویشان است
خسروان قبلهٔ حاجاتِ جهانند ولی
سببش بندگیِ حضرتِ درویشان است
روی مقصود که شاهان به دعا می‌طلبند
مَظهَرَش آینهٔ طلعتِ درویشان است
از کران تا به کران لشکر ظلم است ولی
از ازل تا به ابد، فرصتِ درویشان است
ای توانگر مَفُروش این همه نِخوَت که تو را
سر و زر در کنفِ همتِ درویشان است
گنجِ قارون که فرو می‌شود از قهر هنوز
خوانده باشی که هم از غیرتِ درویشان است
حافظ ار آبِ حیاتِ ازلی می‌خواهی
منبعش خاکِ درِ خلوتِ درویشان است
من غلامِ نظرِ آصفِ عهدم کو را
صورتِ خواجگی و سیرتِ درویشان است
""",

"غزل۵۰" : """به دامِ زلفِ تو دل مبتلایِ خویشتن است
بکُش به غمزه که اینش سزایِ خویشتن است
گرت ز دست برآید مرادِ خاطرِ ما
به دست باش که خیری به جایِ خویشتن است
به جانت ای بتِ شیرین دهن که همچون شمع
شبانِ تیره مرادم فنای خویشتن است
چو رای عشق زدی با تو گفتم ای بلبل
مَکُن که آن گلِ خندان به رای خویشتن است
به مشک چین و چِگِل نیست بوی گل محتاج
که نافه‌هاش ز بندِ قبایِ خویشتن است
مرو به خانهٔ اربابِ بی‌مروتِ دهر
که گنجِ عافیتت در سرای خویشتن است
بسوخت حافظ و در شرطِ عشقبازی او
هنوز بر سرِ عهد و وفایِ خویشتن است
""",

"غزل۵۱" : """لعلِ سیرابِ به خون تشنه لب یار من است
وز پی دیدنِ او دادنِ جان کار من است
شرم از آن چشمِ سیه بادش و مژگان دراز
هر که دل بردنِ او دید و در انکارِ من است
ساروان رَخت به دروازه مَبَر کان سرِ کو
شاهراهیست که منزلگهِ دلدارِ من است
بندهٔ طالعِ خویشم که در این قحطِ وفا
عشق آن لولیِ سرمست خریدار من است
طَبلِهٔ عطرِ گل و زلفِ عبیر افشانش
فیضِ یک شَمِّه ز بوی خوشِ عطارِ من است
باغبان همچو نسیمم ز درِ خویش مران
کآبِ گلزارِ تو از اشکِ چو گلنارِ من است
شربتِ قند و گلاب از لبِ یارم فرمود
نرگس او که طبیبِ دلِ بیمارِ من است
آن که در طرزِ غزل نکته به حافظ آموخت
یارِ شیرین‌سخنِ نادره‌گفتارِ من است
""",

"غزل۵۲" : """روزگاریست که سودایِ بتان دینِ من است
غمِ این کار نشاطِ دلِ غمگینِ من است
دیدنِ رویِ تو را دیدهٔ جان بین باید
وین کجا مرتبهٔ چشمِ جهان بینِ من است؟
یارِ من باش که زیبِ فلک و زینتِ دهر
از مه روی تو و اشکِ چو پروینِ من است
تا مرا عشقِ تو تعلیمِ سخن گفتن کرد
خلق را وردِ زبان، مدحت و تحسینِ من است
دولت فقر خدایا به من ارزانی دار
کاین کرامت سببِ حشمت و تمکینِ من است
واعظِ شَحنه شناس این عظمت گو مفروش
زان که منزلگهِ سلطان، دلِ مسکینِ من است
یا رب این کعبهٔ مقصود تماشاگه کیست؟
که مغیلانِ طریقش گل و نسرینِ من است
حافظ از حشمتِ پرویز دگر قصه مخوان
که لبش جرعه کش خسرو شیرین من است
""",

"غزل۵۳" : """منم که گوشهٔ میخانه خانقاهِ من است
دعایِ پیرِ مغان وردِ صبحگاهِ من است
گَرَم ترانهٔ چنگ صَبوح نیست چه باک
نوایِ من به سحر آهِ عذرخواهِ من است
ز پادشاه و گدا فارغم بحمدالله
گدایِ خاکِ درِ دوست، پادشاه من است
غرض ز مسجد و میخانه‌ام وصال شماست
جز این خیال ندارم خدا گواهِ من است
مگر به تیغ اجل خیمه بَرکَنَم ور نی
رمیدن از درِ دولت نه رسم و راهِ من است
از آن زمان که بر این آستان نهادم روی
فرازِ مسندِ خورشید، تکیه‌گاهِ من است
گناه اگر چه نبود اختیارِ ما حافظ
تو در طریقِ ادب باش، گو گناهِ من است
""",

"غزل۵۴" : """ز گریه مَردُمِ چشمم نشسته در خون است
ببین که در طلبت حالِ مَردُمان چون است
به یادِ لعلِ تو و چشمِ مستِ میگونت
ز جامِ غم، می لعلی که می‌خورم خون است
ز مشرقِ سرِ کو آفتابِ طلعتِ تو
اگر طلوع کند، طالعم همایون است
حکایتِ لبِ شیرین، کلام فرهاد است
شِکَنجِ طُرِّهٔ لیلی،ِ مقام مجنون است
دلم بجو که قدت همچو سرو دلجوی است
سخن بگو که کلامت لطیف و موزون است
ز دورِ باده به جان، راحتی رسان ساقی
که رنجِ خاطرم از جورِ دورِ گردون است
از آن دمی که ز چشمم برفت رودِ عزیز
کنارِ دامنِ من همچو رودِ جیحون است
چگونه شاد شود اندرونِ غمگینم؟
به اختیار، که از اختیار بیرون است
ز بیخودی طلبِ یار می‌کند حافظ
چو مفلسی که طلبکارِ گنجِ قارون است
""",

"غزل۵۵" : """خَمِ زلفِ تو دامِ کفر و دین است
ز کارستانِ او یک شمه این است
جمالت مُعجِزِ حُسن است لیکن
حدیثِ غمزه‌ات سحرِ مبین است
ز چشمِ شوخِ تو جان کی توان برد؟
که دایم با کمان اندر کمین است
بر آن چشمِ سیه صد آفرین باد
که در عاشق کُشی سِحرآفرین است
عجب عِلمیست عِلم هیئت عشق
که چرخِ هشتمش، هفتم زمین است
تو پنداری که بدگو رفت و جان برد؟
حسابش با کرام الکاتبین است
مشو حافظ ز کیدِ زلفش ایمن
که دل برد و کنون در بندِ دین است
""",

"غزل۵۶" : """دل سراپردهٔ محبتِ اوست
دیده آیینه دارِ طلعت اوست
من که سر درنیاورم به دو کون
گردنم زیرِ بارِ منتِ اوست
تو و طوبی و ما و قامتِ یار
فکرِ هر کس به قدرِ همتِ اوست
گر من آلوده دامنم چه عجب
همه عالم گواهِ عصمتِ اوست
من که باشم در آن حرم که صبا
پرده دارِ حریمِ حُرمتِ اوست
بی خیالش مباد منظرِ چشم
زان که این گوشه جایِ خلوتِ اوست
هر گلِ نو که شد چمن آرای
ز اثر رنگ و بویِ صحبتِ اوست
دورِ مجنون گذشت و نوبتِ ماست
هر کسی پنج روز، نوبتِ اوست
مُلکَتِ عاشقی و گنجِ طرب
هر چه دارم ز یُمنِ همتِ اوست
من و دل گر فدا شدیم چه باک؟
غرض اندر میان سلامتِ اوست
فقرِ ظاهر مبین که حافظ را
سینه گنجینهٔ محبتِ اوست
""",

"غزل۵۷" : """آن سیه چَرده که شیرینیِ عالم با اوست
چشمِ میگون لبِ خندان دلِ خرم با اوست
گرچه شیرین دهنان پادشهانند ولی
او سلیمانِ زمان است که خاتم با اوست
رویِ خوب است و کمالِ هنر و دامنِ پاک
لاجرم همتِ پاکان دو عالم با اوست
خال مِشکین که بدان عارض گندمگون است
سِرِّ آن دانه که شد رهزنِ آدم با اوست
دلبرم عزم سفر کرد خدا را یاران
چه کنم با دل مجروح که مرهم با اوست
با که این نکته توان گفت که آن سنگین دل
کُشت ما را و دمِ عیسیِ مریم با اوست
حافظ از معتقدان است گرامی دارش
زان که بخشایشِ بس روحِ مکرم با اوست
""",

"غزل۵۸" : """سرِ ارادتِ ما و آستانِ حضرت دوست
که هر چه بر سرِ ما می‌رود ارادتِ اوست
نظیرِ دوست ندیدم اگر چه از مَه و مِهر
نهادم آینه‌ها در مقابلِ رخِ دوست
صبا ز حالِ دلِ تنگِ ما چه شرح دهد؟
که چون شِکَنجِ ورق‌هایِ غنچه تو بر توست
نه من سَبوکش این دیرِ رندسوزم و بس
بسا سَرا که در این کارخانه سنگ و سبوست
مگر تو شانه زدی زلفِ عنبرافشان را؟
که بادْ غالیه‌سا گشت و خاکْ عنبربوست
نثارِ رویِ تو هر برگِ گل که در چمن است
فدای قَدِّ تو هر سروبُن که بر لبِ جوست
زبانِ ناطقه در وصفِ شوق نالان است
چه جای کِلکِ بریده‌زبانِ بیهُده‌گوست؟
رخِ تو در دلم آمد مراد خواهم یافت
چرا که حالِ نکو در قَفایِ فالِ نکوست
نه این زمان دلِ حافظ در آتشِ هوس است
که داغدار ازل همچو لالهٔ خودروست
""",

"غزل۵۹" : """دارم امید عاطفتی از جناب دوست
کردم جنایتی و امیدم به عفو اوست
دانم که بُگذرد ز سرِ جرمِ من که او
گر چه پریوش است ولیکن فرشته خوست
چندان گریستیم که هر کس که برگذشت
در اشکِ ما چو دید روان گفت کاین چه جوست؟
هیچ است آن دهان و نبینم از او نشان
موی است آن میان و ندانم که آن چه موست
دارم عجب ز نقشِ خیالش که چون نرفت
از دیده‌ام که دَم به دَمش کار شُست و شوست
بی گفت و گوی زلفِ تو دل را همی‌کشد
با زلف دلکَش تو که را روی گفت و گوست؟
عمریست تا ز زلفِ تو بویی شنیده‌ام
زان بوی در مشامِ دلِ من هنوز بوست
حافظ بد است حالِ پریشانِ تو، ولی
بر بویِ زلفِ یار پریشانیَت نکوست
""",

"غزل۶۰" : """آن پیکِ ناموَر که رسید از دیارِ دوست
آورد حِرزِ جان ز خطِ مُشکبارِ دوست
خوش می‌دهد نشانِ جلال و جمالِ یار
خوش می‌کند حکایتِ عِزّ و وقارِ دوست
دل دادمش به مژده و خِجلَت همی‌برم
زین نقدِ قلبِ خویش که کردم نثارِ دوست
شکرِ خدا که از مددِ بختِ کارساز
بر حسبِ آرزوست همه کار و بارِ دوست
سیرِ سپهر و دورِ قمر را چه اختیار؟
در گردشند بر حَسَبِ اختیار دوست
گر بادِ فتنه هر دو جهان را به هم زند
ما و چراغِ چَشم و رهِ انتظارِ دوست
کُحلُ الجَواهری به من آر ای نسیمِ صبح
زان خاکِ نیکبخت که شد رهگذارِ دوست
ماییم و آستانهٔ عشق و سرِ نیاز
تا خوابِ خوش که را بَرَد اندر کنارِ دوست
دشمن به قصدِ حافظ اگر دم زند چه باک؟
مِنَّت خدای را که نیَم شرمسارِ دوست
""",

"غزل۶۱" : """صبا اگر گذری اُفتَدَت به کشور دوست
بیار نَفحِه‌ای از گیسوی مُعَنبَر دوست
به جانِ او که به شکرانه جان برافشانم
اگر به سویِ من آری پیامی از برِ دوست
و گر چنان که در آن حضرتت نباشد بار
برایِ دیده بیاور غباری از درِ دوست
منِ گدا و تمنایِ وصلِ او هیهات
مگر به خواب ببینم خیالِ منظرِ دوست
دل صِنوبَریَم همچو بید لرزان است
ز حسرتِ قد و بالای چون صنوبرِ دوست
اگر چه دوست به چیزی نمی‌خرد ما را
به عالمی نفروشیم مویی از سرِ دوست
چه باشد ار شود از بندِ غم دلش آزاد
چو هست حافظِ مسکین غلام و چاکر دوست
""",

"غزل۶۲" : """مرحبا ای پیکِ مشتاقان بده پیغامِ دوست
تا کُنم جان از سرِ رغبت فدای نامِ دوست
واله و شیداست دایم همچو بلبل در قفس
طوطی طبعم ز عشقِ شِکَّر و بادامِ دوست
زلفِ او دام است و خالش دانهٔ آن دام و من
بر امیدِ دانه‌ای افتاده‌ام در دامِ دوست
سر ز مستی برنگیرد تا به صبحِ روزِ حشر
هر که چون من در ازل یک جرعه خورد از جامِ دوست
بس نگویم شِمِّه‌ای از شرحِ شوقِ خود از آنک
دردسر باشد نمودن بیش از این ابرامِ دوست
گر دهد دستم کشم در دیده همچون توتیا
خاک راهی کان مشرف گردد از اَقدامِ دوست
میل من سویِ وصال و قصد او سویِ فراق
تَرکِ کامِ خود گرفتم تا برآید کامِ دوست
حافظ اندر دَردِ او می‌سوز و بی‌درمان بساز
زان که درمانی ندارد دَردِ بی‌آرامِ دوست
""",

"غزل۶۳" : """رویِ تو کس ندید و هزارت رقیب هست
در غنچه‌ای هنوز و صدت عندلیب هست
گر آمدم به کوی تو چندان غریب نیست
چون من در آن دیار هزاران غریب هست
در عشق، خانقاه و خرابات فرق نیست
هر جا که هست پرتوِ رویِ حبیب هست
آن جا که کارِ صومعه را جلوه می‌دهند
ناقوسِ دِیرِ راهب و نامِ صلیب هست
عاشق که شد که یار به حالش نظر نکرد
ای خواجه درد نیست وگرنه طبیب هست
فریادِ حافظ این همه آخِر به هرزه نیست
هم قصه‌ای غریب و حدیثی عجیب هست
""",

"غزل۶۴" : """اگر چه عرض هنر پیشِ یار بی‌ادبیست
زبان خموش، ولیکن دهان پُر از عربیست
پری نهفته رخ و دیو در کرشمهٔ حُسن
بسوخت دیده ز حیرت که این چه بوالعجبیست
در این چمن گلِ بی خار کس نچید آری
چراغِ مصطفوی با شرارِ بولَهَبیست
سبب مپرس که چرخ از چه سفله پرور شد
که کام بخشی او را بهانه بی سببیست
به نیم جو نخرم طاقِ خانقاه و رباط
مرا که مَصطَبه ایوان و پای خُم طَنَبیست
جمالِ دختر رَز نورِ چشمِ ماست مگر
که در نقابِ زجاجی و پردهٔ عِنبیست
هزار عقل و ادب داشتم من ای خواجه
کنون که مستِ خرابم، صلاح بی‌ادبیست
بیار می که چو حافظ هزارم استظهار
به گریهٔ سحری و نیازِ نیم شبیست
""",

"غزل۶۵" : """خوشتر ز عیش و صحبت و باغ و بهار چیست؟
ساقی کجاست، گو سببِ انتظار چیست؟
هر وقتِ خوش که دست دهد مغتنم شمار
کس را وقوف نیست که انجامِ کار چیست
پیوندِ عمر بسته به موییست هوش دار
غمخوارِ خویش باش، غم روزگار چیست؟
معنیِ آبِ زندگی و روضهٔ ارم
جز طَرفِ جویبار و میِ خوشگوار چیست؟
مستور و مست هر دو چو از یک قبیله‌اند
ما دل به عشوهٔ که دهیم اختیار چیست؟
راز درونِ پرده چه داند فلک، خموش
ای مدعی نزاعِ تو با پرده دار چیست؟
سهو و خطایِ بنده گَرَش اعتبار نیست
معنیِ عفو و رحمتِ آمُرزگار چیست؟
زاهد شرابِ کوثر و حافظ پیاله خواست
تا در میانه خواستهٔ کردگار چیست
""",

"غزل۶۶" : """بنال بلبل اگر با مَنَت سرِ یاریست
که ما دو عاشق زاریم و کارِ ما زاریست
در آن زمین که نسیمی وزد ز طُرِّهٔ دوست
چه جایِ دم زدنِ نافه‌های تاتاریست
بیار باده که رنگین کنیم جامهٔ زرق
که مستِ جامِ غروریم و نام هشیاریست
خیالِ زلفِ تو پختن نه کارِ هر خامیست
که زیرِ سلسله رفتن طریقِ عیّاریست
لطیفه‌ایست نهانی که عشق از او خیزد
که نام آن نه لبِ لعل و خطِ زنگاریست
جمالِ شخص، نه چشم است و زلف و عارض و خال
هزار نکته در این کار و بارِ دلداریست
قلندرانِ حقیقت به نیم جو نخرند
قبایِ اطلس آن کس که از هنر عاریست
بر آستان تو مشکل توان رسید آری
عروج بر فلکِ سروری به دشواریست
سحر کرشمهٔ چشمت به خواب می‌دیدم
زهی مراتب خوابی که بِه ز بیداریست
دلش به ناله میازار و ختم کن حافظ
که رستگاریِ جاوید در کم آزاریست
""",

"غزل۶۷" : """یا رب این شمع دل افروز ز کاشانهٔ کیست؟
جانِ ما سوخت، بپرسید که جانانهٔ کیست؟
حالیا خانه‌براندازِ دل و دین من است
تا در آغوش که می‌خسبد و همخانهٔ کیست
بادهٔ لعل لبش کز لبِ من دور مباد
راحِ روح که و پیمان‌دهِ پیمانهٔ کیست؟
دولتِ صحبتِ آن شمعِ سعادت‌پرتو
باز پرسید خدا را که به پروانهٔ کیست؟
می‌دهد هر کَسَش افسونی و معلوم نشد
که دلِ نازکِ او مایلِ افسانهٔ کیست
یا رب آن شاه‌وَشِ ماه‌رخِ زهره‌جبین
دُرِّ یکتایِ که و گوهر یک‌دانهٔ کیست؟
گفتم آه از دلِ دیوانهٔ حافظ بی تو
زیرِ لب خنده زنان گفت که دیوانهٔ کیست؟
""",


"غزل۶۸" : """ماهم این هفته برون رفت و به چشمم سالیست
حالِ هجران تو چه دانی که چه مشکل حالیست
مردم دیده ز لطفِ رخِ او در رخِ او
عکس خود دید، گمان برد که مِشکین خالیست
می‌چکد شیر هنوز از لبِ همچون شکرش
گر چه در شیوه گری هر مژه‌اش قَتّالیست
ای که انگشت نمایی به کرم در همه شهر
وه که در کارِ غریبان، عَجَبَت اِهمالیست
بعد از اینم نَبُوَد شائبه در جوهرِ فرد
که دهانِ تو در این نکته خوش استدلالیست
مژده دادند که بر ما گذری خواهی کرد
نیتِ خیر مگردان که مبارک فالیست
کوهِ اندوهِ فراقت به چه حالت بکشد؟
حافظ خسته که از ناله تنش چون نالیست
""",

"غزل۶۹" : """کس نیست که افتادهٔ آن زلفِ دوتا نیست
در رهگذرِ کیست که دامی ز بلا نیست
چون چشمِ تو دل می‌برد از گوشه نشینان
همراهِ تو بودن گُنَه از جانب ما نیست
روی تو مگر آینهٔ لطفِ الهیست
حقا که چنین است و در این روی و ریا نیست
نرگس طلبد شیوهٔ چشمِ تو، زهی چشم
مسکین خبرش از سر و، در دیده حیا نیست
از بهرِ خدا زلف مَپیرای که ما را
شب نیست که صد عربده با بادِ صبا نیست
بازآی که بی روی تو ای شمعِ دل افروز
در بزمِ حریفان، اثرِ نور و صفا نیست
تیمارِ غریبان اثرِ ذکرِ جمیل است
جانا مگر این قاعده در شهرِ شما نیست؟
دی می‌شد و گفتم صنما عهد به جای آر
گفتا غلطی خواجه در این عهد وفا نیست
گر پیر مغان مرشدِ من شد چه تفاوت
در هیچ سری نیست که سِرّی ز خدا نیست
عاشق چه کُنَد گر نَکِشَد بارِ ملامت
با هیچ دلاور سپرِ تیرِ قضا نیست
در صومعهٔ زاهد و در خلوتِ صوفی
جز گوشهٔ ابروی تو محرابِ دعا نیست
ای چنگ فروبرده به خونِ دلِ حافظ
فکرت مگر از غیرتِ قرآن و خدا نیست
""",

"غزل۷۰" : """مردم دیدهٔ ما جز به رُخَت ناظر نیست
دل سرگشتهٔ ما غیرِ تو را ذاکر نیست
اشکم احرامِ طوافِ حَرَمَت می‌بندد
گر چه از خونِ دلِ ریش دمی طاهر نیست
بستهٔ دام و قفس باد چو مرغ وحشی
طایر سِدره اگر در طلبت طایر نیست
عاشقِ مفلس اگر قلبِ دلش کرد نثار
مَکُنَش عیب که بر نقدِ روان قادر نیست
عاقبت دست بدان سروِ بلندش برسد
هر که را در طلبت همتِ او قاصر نیست
از روان بخشی عیسی نزنم دَم هرگز
زان که در روح فَزایی چو لبت ماهر نیست
من که در آتشِ سودای تو آهی نزنم
کِی توان گفت که بر داغ، دلم صابر نیست
روز اول که سرِ زلفِ تو دیدم گفتم
که پریشانیِ این سلسله را آخر نیست
سَرِ پیوند تو تنها نه دلِ حافظ راست
کیست آن کِش سَرِ پیوند تو در خاطر نیست
""",

"غزل۷۱" : """زاهدِ ظاهرپرست از حالِ ما آگاه نیست
در حقِ ما هر چه گوید جایِ هیچ اکراه نیست
در طریقت هر چه پیشِ سالک آید خیرِ اوست
در صراطِ مستقیم ای دل کسی گمراه نیست
تا چه بازی رخ نماید بیدَقی خواهیم راند
عرصهٔ شطرنجِ رندان را مجالِ شاه نیست
چیست این سقفِ بلندِ سادهٔ بسیارنقش
زین معما هیچ دانا در جهان آگاه نیست
این چه استغناست یا رب وین چه قادر حکمت است
کاین همه زخمِ نهان هست و مجالِ آه نیست
صاحبِ دیوانِ ما گویی نمی‌داند حساب
کاندر این طُغرا نشانِ حِسبَةً لِلّه نیست
هر که خواهد گو بیا و هر چه خواهد گو بگو
کِبر و ناز و حاجِب و دربان بدین درگاه نیست
بر درِ میخانه رفتن کارِ یکرنگان بود
خودفروشان را به کویِ می‌فروشان راه نیست
هر چه هست از قامتِ ناسازِ بی اندام ماست
ور نه تشریفِ تو بر بالایِ کس کوتاه نیست
بندهٔ پیرِ خراباتم که لطفش دایم است
ور نه لطفِ شیخ و زاهد، گاه هست و گاه نیست
حافظ ار بر صدر ننشیند ز عالی‌مشربیست
عاشقِ دُردی‌کش اندر بندِ مال و جاه نیست
""",

"غزل۷۲" : """روشن از پرتوِ رویت نظری نیست که نیست
مِنَّت خاکِ درت بر بصری نیست که نیست
ناظرِ روی تو صاحب نظرانند آری
سِرِّ گیسوی تو در هیچ سری نیست که نیست
اشکِ غَمّازِ من ار سرخ برآمد چه عجب؟
خجل از کردهٔ خود پرده دری نیست که نیست
تا به دامن ننشیند ز نسیمش گَردی
سیل خیز از نظرم رهگذری نیست که نیست
تا دم از شامِ سرِ زلفِ تو هر جا نزنند
با صبا گفت و شنیدم سحری نیست که نیست
من از این طالع شوریده بِرَنجَم ور نی
بهره مند از سَرِ کویت دگری نیست که نیست
از حیایِ لبِ شیرینِ تو ای چشمهٔ نوش
غرق آب و عرق اکنون شکری نیست که نیست
مصلحت نیست که از پرده برون افتد راز
ور نه در مجلسِ رندان خبری نیست که نیست
شیر در بادیهٔ عشق تو روباه شود
آه از این راه که در وی خطری نیست که نیست
آب چشمم که بر او مِنَّت خاکِ درِ توست
زیرِ صد مِنَّتِ او خاکِ دری نیست که نیست
از وجودم قَدَری نام و نشان هست که هست
ور نه از ضعف در آن جا اثری نیست که نیست
غیر از این نکته که حافظ ز تو ناخشنود است
در سراپای وجودت هنری نیست که نیست
""",

"غزل۷۳" : """روشن از پرتوِ رویت نظری نیست که نیست
مِنَّت خاکِ درت بر بصری نیست که نیست
ناظرِ روی تو صاحب نظرانند آری
سِرِّ گیسوی تو در هیچ سری نیست که نیست
اشکِ غَمّازِ من ار سرخ برآمد چه عجب؟
خجل از کردهٔ خود پرده دری نیست که نیست
تا به دامن ننشیند ز نسیمش گَردی
سیل خیز از نظرم رهگذری نیست که نیست
تا دم از شامِ سرِ زلفِ تو هر جا نزنند
با صبا گفت و شنیدم سحری نیست که نیست
من از این طالع شوریده بِرَنجَم ور نی
بهره مند از سَرِ کویت دگری نیست که نیست
از حیایِ لبِ شیرینِ تو ای چشمهٔ نوش
غرق آب و عرق اکنون شکری نیست که نیست
مصلحت نیست که از پرده برون افتد راز
ور نه در مجلسِ رندان خبری نیست که نیست
شیر در بادیهٔ عشق تو روباه شود
آه از این راه که در وی خطری نیست که نیست
آب چشمم که بر او مِنَّت خاکِ درِ توست
زیرِ صد مِنَّتِ او خاکِ دری نیست که نیست
از وجودم قَدَری نام و نشان هست که هست
ور نه از ضعف در آن جا اثری نیست که نیست
غیر از این نکته که حافظ ز تو ناخشنود است
در سراپای وجودت هنری نیست که نیست
""",

"غزل۷۴" : """حاصلِ کارگه کون و مکان این همه نیست
باده پیش آر که اسبابِ جهان این همه نیست
از دل و جان شرفِ صحبتِ جانان غرض است
غرض این است، وگرنه دل و جان این همه نیست
مِنَّتِ سِدره و طوبی ز پیِ سایه مکش
که چو خوش بنگری ای سروِ روان این همه نیست
دولت آن است که بی خونِ دل آید به کنار
ور نه با سعی و عمل باغِ جَنان این همه نیست
پنج روزی که در این مرحله مهلت داری
خوش بیاسای زمانی که زمان این همه نیست
بر لبِ بحرِ فنا منتظریم ای ساقی
فرصتی دان که ز لب تا به دهان این همه نیست
زاهد ایمن مشو از بازیِ غیرت، زنهار
که ره از صومعه تا دیرِ مغان این همه نیست
دردمندیِّ منِ سوختهٔ زار و نَزار
ظاهراً حاجتِ تقریر و بیان این همه نیست
نام حافظ رقمِ نیک پذیرفت ولی
پیش رندان رقمِ سود و زیان این همه نیست
""",

"غزل۷۵" : """خوابِ آن نرگسِ فَتّانِ تو، بی چیزی نیست
تابِ آن زلفِ پریشانِ تو، بی چیزی نیست
از لبت شیر روان بود که من می‌گفتم
این شکر گِردِ نمکدانِ تو، بی چیزی نیست
جان درازیِ تو بادا که یقین می‌دانم
در کمان ناوَک مژگانِ تو، بی چیزی نیست
مبتلایی به غمِ محنت و اندوهِ فراق
ای دل این ناله و افغان تو، بی چیزی نیست
دوش، باد از سرِ کویش به گلستان بگذشت
ای گل این چاکِ گریبانِ تو، بی چیزی نیست
دردِ عشق ار چه دل از خلق نهان می‌دارد
حافظ این دیدهٔ گریانِ تو، بی چیزی نیست
""",

"غزل۷۶" : """جز آستان توام در جهان پناهی نیست
سرِ مرا به جز این در، حواله گاهی نیست
عدو چو تیغ کِشد، من سپر بیندازم
که تیغِ ما به جز از ناله‌ای و آهی نیست
چرا ز کویِ خرابات روی برتابم
کز این بِهَم، به جهان هیچ رسم و راهی نیست
زمانه گر بزند آتشم به خرمنِ عمر
بگو بسوز که بر من به برگِ کاهی نیست
غلامِ نرگسِ جَمّاشِ آن سَهی سَروم
که از شرابِ غرورش به کس نگاهی نیست
مباش در پی آزار و هر چه خواهی کن
که در شریعتِ ما غیر از این گناهی نیست
عِنان کشیده رو ای پادشاهِ کشورِ حُسن
که نیست بر سر راهی که دادخواهی نیست
چنین که از همه سو دامِ راه می‌بینم
بِه از حمایتِ زلفش مرا پناهی نیست
خزینهٔ دلِ حافظ به زلف و خال مده
که کارهای چنین، حَدِّ هر سیاهی نیست
""",

"غزل۷۷" : """بلبلی برگِ گُلی خوش رنگ در منقار داشت
و اندر آن برگ و نوا خوش ناله‌هایِ زار داشت
گفتمش در عین وصل، این ناله و فریاد چیست؟
گفت ما را جلوهٔ معشوق در این کار داشت
یار اگر ننشست با ما نیست جای اعتراض
پادشاهی کامران بود، از گدایی عار داشت
در نمی‌گیرد نیاز و نازِ ما با حُسنِ دوست
خُرَّم آن کز نازنینان، بختِ برخوردار داشت
خیز تا بر کِلکِ آن نقاش، جان افشان کنیم
کاین همه نقشِ عجب در گردشِ پرگار داشت
گر مریدِ راهِ عشقی فکرِ بدنامی مکن
شیخِ صنعان خرقه رهنِ خانهٔ خَمّار داشت
وقتِ آن شیرین قلندر خوش که در اَطوارِ سیر
ذکرِ تسبیحِ مَلَک در حلقهٔ زُنّار داشت
چشمِ حافظ زیرِ بامِ قصرِ آن حوری سرشت
شیوهٔ جَنّاتُ تَجری تَحتِهَا الاَنهار داشت
""",

"غزل۷۸" : """دیدی که یار، جز سَرِ جور و ستم نداشت
بشکست عهد، وز غمِ ما هیچ غم نداشت
یا رب مگیرش ار چه دلِ چون کبوترم
افکند و کُشت و عزتِ صیدِ حرم نداشت
بر من جفا ز بختِ من آمد وگرنه یار
حاشا که رسمِ لطف و طریقِ کَرَم نداشت
با این همه هر آن که نه خواری کشید از او
هر جا که رفت، هیچ کَسَش محترم نداشت
ساقی بیار باده و با محتسب بگو
انکارِ ما مَکُن که چنین جام، جم نداشت
هر راهرو که ره به حریمِ درش نبرد
مسکین بُرید وادی و ره در حرم نداشت
حافظ بِبَر تو گویِ فصاحت که مدعی
هیچش هنر نبود و خبر نیز هم نداشت
""",

"غزل۷۹" : """کنون که می‌دمد از بوستان نسیمِ بهشت
من و شرابِ فرح بخش و یارِ حورسرشت
گدا چرا نزند لافِ سلطنت امروز؟
که خیمه سایهٔ ابر است و بزمگه لبِ کِشت
چمن حکایتِ اردیبهشت می‌گوید
نه عاقل است که نسیه خرید و نقد بِهِشت
به می عمارتِ دل کن که این جهانِ خراب
بر آن سر است که از خاکِ ما بسازد خشت
وفا مجوی ز دشمن که پرتوی ندهد
چو شمع صومعه افروزی از چراغِ کنشت
مَکُن به نامه سیاهی مَلامَتِ منِ مست
که آگه است که تقدیر بر سرش چه نوشت؟
قدم دریغ مدار از جنازهٔ حافظ
که گر چه غرقِ گناه است می‌رود به بهشت
""",

"غزل۸۰" : """عیبِ رندان مَکُن ای زاهدِ پاکیزه سرشت
که گناهِ دگران بر تو نخواهند نوشت
من اگر نیکم و گر بد تو برو خود را باش
هر کسی آن دِرَوَد عاقبتِ کار، که کِشت
همه کس طالبِ یارند چه هشیار و چه مست
همه جا خانهٔ عشق است چه مسجد چه کِنِشت
سرِ تسلیمِ من و خشتِ درِ میکده‌ها
مدعی گر نکند فهمِ سخن، گو سر و خشت
ناامیدم مکن از سابقهٔ لطفِ ازل
تو پسِ پرده چه دانی که که خوب است و که زشت
نه من از پردهٔ تقوا به درافتادم و بس
پدرم نیز بهشتِ ابد از دست بهشت
حافظا روزِ اجل گر به کف آری جامی
یک سر از کویِ خرابات بَرَندَت به بهشت
""",

"غزل۸۱" : """صبحدم مرغِ چمن با گلِ نوخاسته گفت
ناز کم کن که در این باغ، بسی چون تو شکفت
گل بخندید که از راست نرنجیم ولی
هیچ عاشق سخنِ سخت به معشوق نگفت
گر طمع داری از آن جامِ مُرَصَّع می لعل
ای بسا دُر که به نوکِ مژه‌ات باید سُفت
تا ابد بوی محبت به مشامش نرسد
هر که خاکِ درِ میخانه به رخساره نَرُفت
در گلستانِ ارم دوش چو از لطف هوا
زلفِ سنبل به نسیمِ سحری می‌آشفت
گفتم ای مَسنَدِ جم، جامِ جهان بینت کو
گفت افسوس که آن دولتِ بیدار بِخُفت
سخنِ عشق نه آن است که آید به زبان
ساقیا می ده و کوتاه کن این گفت و شِنُفت
اشکِ حافظ خرد و صبر به دریا انداخت
چه کند سوزِ غمِ عشق نیارَست نهفت
""",

"غزل۸۲" : """آن تُرک پری چهره که دوش از بَرِ ما رفت
آیا چه خطا دید که از راهِ خطا رفت؟
تا رفت مرا از نظر آن چشمِ جهان بین
کس واقفِ ما نیست که از دیده چه‌ها رفت
بر شمع نرفت از گذرِ آتشِ دل، دوش
آن دود که از سوزِ جگر بر سر ما رفت
دور از رخِ تو دم به دم از گوشهٔ چشمم
سیلابِ سرشک آمد و طوفانِ بلا رفت
از پای فتادیم چو آمد غمِ هجران
در درد بمردیم چو از دست دوا رفت
دل گفت وصالش به دعا باز توان یافت
عمریست که عمرم همه در کارِ دعا رفت
احرام چه بندیم؟ چو آن قبله نه این جاست
در سعی چه کوشیم؟ چو از مروه صفا رفت
دی گفت طبیب از سرِ حسرت چو مرا دید
هیهات که رنجِ تو ز قانونِ شفا رفت
ای دوست به پرسیدنِ حافظ قدمی نه
زان پیش که گویند که از دارِ فنا رفت
""",

"غزل۸۳" : """گر ز دستِ زلفِ مُشکینت خطایی رفت رفت
ور ز هندویِ شما بر ما جفایی رفت رفت
برقِ عشق ار خرمنِ پشمینه پوشی سوخت سوخت
جورِ شاه کامران گر بر گدایی رفت رفت
در طریقت رنجشِ خاطر نباشد می بیار
هر کدورت را که بینی چون صفایی رفت رفت
عشقبازی را تحمل باید ای دل، پای دار
گر ملالی بود بود و گر خطایی رفت رفت
گر دلی از غمزهٔ دلدار باری برد برد
ور میان جان و جانان ماجرایی رفت رفت
از سخن چینان ملالت‌ها پدید آمد ولی
گر میانِ همنشینان ناسزایی رفت رفت
عیبِ حافظ گو مکن واعظ که رفت از خانقاه
پای آزادی چه بندی؟ گر به جایی رفت رفت
""",

"غزل۸۴" : """ساقی بیار باده که ماهِ صیام رفت
دَردِه قدح که موسمِ ناموس و نام رفت
وقتِ عزیز رفت بیا تا قضا کنیم
عمری که بی حضور صُراحی و جام رفت
مستم کن آن چنان که ندانم ز بیخودی
در عرصهٔ خیال که آمد، کدام رفت
بر بوی آن که جرعهٔ جامت به ما رسد
در مَصطَبِه دعایِ تو هر صبح و شام رفت
دل را که مرده بود حیاتی به جان رسید
تا بویی از نسیمِ می‌اش در مشام رفت
زاهد غرور داشت، سلامت نبرد راه
رند از رهِ نیاز به دارالسلام رفت
نقدِ دلی که بود مرا صرف باده شد
قلبِ سیاه بود از آن در حرام رفت
در تابِ توبه چند توان سوخت همچو عود
می ده که عمر در سرِ سودای خام رفت
دیگر مکن نصیحتِ حافظ که ره نیافت
گمگشته‌ای که بادهٔ نابش به کام رفت
""",

"غزل۸۵" : """شربتی از لبِ لعلش نچشیدیم و بِرَفت
رویِ مَه پیکرِ او سیر ندیدیم و برفت
گویی از صحبتِ ما نیک به تنگ آمده بود
بار بربست و به گَردش نرسیدیم و برفت
بس که ما فاتحه و حرزِ یمانی خواندیم
وز پی اش سوره اخلاص دمیدیم و برفت
عشوه دادند که بر ما گذری خواهی کرد
دیدی آخر که چنین عشوه خریدیم و برفت
شد چمان در چمنِ حسن و لطافت لیکن
در گلستانِ وصالش نَچَمیدیم و برفت
همچو حافظ همه شب ناله و زاری کردیم
کای دریغا به وداعش نرسیدیم و برفت
""",

"غزل۸۶" : """ساقی بیا که یار ز رخ پرده برگرفت
کارِ چراغ خلوتیان باز درگرفت
آن شمعِ سرگرفته دگر چهره برفروخت
وین پیرِ سالخورده جوانی ز سر گرفت
آن عشوه داد عشق که مفتی ز ره برفت
وان لطف کرد دوست که دشمن حذر گرفت
زنهار از آن عبارتِ شیرینِ دلفریب
گویی که پستهٔ تو سخن در شکر گرفت
بارِ غمی که خاطرِ ما خسته کرده بود
عیسی دمی خدا بفرستاد و برگرفت
هر سروقد که بر مَه و خور حسن می‌فروخت
چون تو درآمدی پیِ کاری دگر گرفت
زین قصه هفت گنبدِ افلاک پرصداست
کوته نظر ببین که سخن مختصر گرفت
حافظ تو این سخن ز که آموختی که بخت؟
تعویذ کرد شعرِ تو را و به زر گرفت
""",

"غزل۸۷" : """حُسنت به اتفاقِ مَلاحت جهان گرفت
آری به اتفاق، جهان می‌توان گرفت
افشایِ رازِ خلوتیان خواست کرد شمع
شکر خدا که سِرِّ دلش در زبان گرفت
زین آتشِ نهفته که در سینهٔ من است
خورشید شعله‌ایست که در آسمان گرفت
می‌خواست گل که دم زند از رنگ و بویِ دوست
از غیرتِ صبا نفسش در دهان گرفت
آسوده بر کنار چو پرگار می‌شدم
دوران چو نقطه عاقبتم در میان گرفت
آن روز شوقِ ساغرِ می خرمنم بسوخت
کاتش ز عکسِ عارضِ ساقی در آن گرفت
خواهم شدن به کویِ مُغان آستین فشان
زین فتنه‌ها که دامنِ آخرزمان گرفت
می خور که هر که آخرِ کار جهان بدید
از غم سبک برآمد و رَطلِ گران گرفت
بر برگِ گل به خونِ شقایق نوشته‌اند
کان کس که پخته شد میِ چون ارغوان گرفت
حافظ چو آبِ لطف ز نظمِ تو می‌چکد
حاسد چگونه نکته تواند بر آن گرفت
""",

"غزل۸۸" : """شنیده‌ام سخنی خوش که پیرِ کنعان گفت
فِراق یار نه آن می‌کند که بتوان گفت
حدیثِ هولِ قیامت که گفت واعظِ شهر
کنایتیست که از روزگارِ هجران گفت
نشانِ یارِ سفرکرده از کِه پُرسم باز
که هر چه گفت بَریدِ صبا پریشان گفت
فغان که آن مهِ نامهربانِ مِهرگُسِل
به تَرکِ صحبت یاران خود چه آسان گفت
من و مقامِ رضا بعد از این و شُکرِ رقیب
که دل به دردِ تو خو کرد و ترکِ درمان گفت
غمِ کهن به میِ سالخورده دفع کنید
که تخم خوشدلی این است پیرِ دهقان گفت
گره به باد مزن گر چه بر مراد رود
که این سخن به مَثَل باد با سلیمان گفت
به مهلتی که سپهرت دهد ز راه مرو
تو را که گفت که این زال تَرک دَستان گفت؟
مزن ز چون و چرا دم که بندهٔ مُقبِل
قبول کرد به جان هر سخن که جانان گفت
که گفت حافظ از اندیشهٔ تو آمد باز؟
من این نگفته‌ام آن کس که گفت بُهتان گفت
""",

"غزل۸۹" : """یا رب سببی ساز که یارم به سلامت
بازآید و بِرهانَدَم از بندِ مَلامت
خاکِ رهِ آن یارِ سفرکرده بیارید
تا چشمِ جهان بین کُنَمَش جایِ اقامت
فریاد که از شش جهتم راه بِبَستند
آن خال و خط و زلف و رخ و عارض و قامت
امروز که در دستِ توام مرحمتی کن
فردا که شَوَم خاک چه سود اشکِ ندامت
ای آن که به تقریر و بیان دم زنی از عشق
ما با تو نداریم سخن، خیر و سلامت
درویش مکن ناله ز شمشیرِ اَحِبّا
کاین طایفه از کشته ستانند غرامت
در خرقه زن آتش که خمِ ابرویِ ساقی
بر می‌شکند گوشهٔ محراب امامت
حاشا که من از جور و جفای تو بنالم
بیدادِ لطیفان همه لطف است و کرامت
کوته نکند بحث سرِ زلف تو حافظ
پیوسته شد این سلسله تا روزِ قیامت
""",

"غزل۹۰" : """ای هدهد صبا به سبا می‌فرستمت
بنگر که از کجا به کجا می‌فرستمت
حیف است طایری چو تو در خاکدانِ غم
زین جا به آشیانِ وفا می‌فرستمت
در راهِ عشق مرحلهٔ قُرب و بُعد نیست
می‌بینمت عیان و دعا می‌فرستمت
هر صبح و شام قافله‌ای از دعای خیر
در صحبتِ شمال و صبا می‌فرستمت
تا لشکرِ غمت نکند مُلکِ دل خراب
جانِ عزیزِ خود به نوا می‌فرستمت
ای غایب از نظر که شدی همنشین دل
می‌گویمت دعا و ثنا می‌فرستمت
در رویِ خود تَفَرُّجِ صُنع خدای کن
کآیینهٔ خدای نما می‌فرستمت
تا مطربان ز شوقِ مَنَت آگهی دهند
قول و غزل به ساز و نوا می‌فرستمت
ساقی بیا که هاتفِ غیبم به مژده گفت
با درد صبر کن که دوا می‌فرستمت
حافظ سرودِ مجلس ما ذکرِ خیرِ توست
بشتاب هان که اسب و قبا می‌فرستمت
""",

"غزل۹۱" : """ای غایب از نظر به خدا می‌سپارمت
جانم بسوختی و به دل دوست دارمت
تا دامنِ کفن نکشم زیرِ پایِ خاک
باور مکن که دست ز دامن بدارمت
محرابِ ابرویت بنما تا سحرگهی
دستِ دعا برآرم و در گردن آرمت
گر بایدم شدن سویِ هاروتِ بابلی
صد گونه جادویی بکنم تا بیارمت
خواهم که پیش میرمت ای بی‌وفا طبیب
بیمار باز پرس که در انتظارمت
صد جوی آب بسته‌ام از دیده بر کنار
بر بویِ تخمِ مِهر که در دل بکارمت
خونم بریخت وز غمِ عشقم خلاص داد
مِنّت پذیرِ غمزهٔ خنجر گذارمت
می‌گریم و مرادم از این سیلِ اشک‌بار
تخمِ محبّت است که در دل بکارمت
بارم ده از کرم سویِ خود تا به سوزِ دل
در پای دم‌به‌دم گهر از دیده بارمت
حافظ شراب و شاهد و رندی نه وضعِ توست
فِی‌الجمله می‌کنی و فرو می‌گذارمت
""",

"غزل۹۲" : """میرِ من خوش می‌روی کاندر سر و پا میرمت
خوش خرامان شو که پیشِ قدِ رعنا میرمت
گفته بودی کی بمیری پیشِ من، تعجیل چیست؟
خوش تقاضا می‌کنی پیشِ تقاضا میرمت
عاشق و مخمور و مهجورم بتِ ساقی کجاست
گو که بِخرامَد که پیشِ سرو بالا میرمت
آن که عمری شد که تا بیمارم از سودایِ او
گو نگاهی کن که پیشِ چشمِ شهلا میرمت
گفته‌ای لعلِ لبم هم درد بخشد هم دوا
گاه پیش درد و گَه پیش مداوا میرمت
خوش خرامان می‌روی چشمِ بد از رویِ تو دور
دارم اندر سر خیالِ آن که در پا میرمت
گر چه جایِ حافظ اندر خلوتِ وصلِ تو نیست
ای همه جایِ تو خوش، پیشِ همه جا میرمت
""",

"غزل۹۳" : """چه لطف بود که ناگاه رَشحِهٔ قَلَمَت
حقوقِ خدمتِ ما عرضه کرد بر کرمت
به نوکِ خامه رقم کرده‌ای سلامِ مرا
که کارخانهٔ دوران مباد بی رَقَمَت
نگویم از منِ بی‌دل به سهو کردی یاد
که در حسابِ خرد نیست سهو بر قَلَمَت
مرا ذلیل مگردان به شکرِ این نعمت
که داشت دولتِ سرمد عزیز و محترمت
بیا که با سرِ زلفت قرار خواهم کرد
که گر سَرَم برود برندارم از قدمت
ز حالِ ما دلت آگه شود مگر وقتی
که لاله بردمد از خاکِ کشتگانِ غمت
روانِ تشنهٔ ما را به جرعه‌ای دریاب
چو می‌دهند زُلالِ خِضِر ز جامِ جَمَت
همیشه وقتِ تو ای عیسیِ صبا خوش باد
که جانِ حافظِ دلخسته زنده شد به دَمَت
""",

"غزل۹۴" : """زان یارِ دلنوازم شُکریست با شکایت
گر نکته دانِ عشقی بشنو تو این حکایت
بی مزد بود و مِنَّت هر خدمتی که کردم
یا رب مباد کس را مخدومِ بی عنایت
رندانِ تشنه لب را آبی نمی‌دهد کس
گویی ولی شناسان رفتند از این ولایت
در زلفِ چون کمندش ای دل مپیچ کانجا
سرها بریده بینی بی جرم و بی جنایت
چشمت به غمزه ما را خون خورد و می‌پسندی
جانا روا نباشد خونریز را حمایت
در این شبِ سیاهم گم گشت راهِ مقصود
از گوشه‌ای برون آی ای کوکبِ هدایت
از هر طرف که رفتم جز وحشتم نَیَفزود
زِنهار از این بیابان وین راهِ بی‌نهایت
ای آفتابِ خوبان می‌جوشد اندرونم
یک ساعتم بِگُنجان در سایهٔ عنایت
این راه را نهایت صورت کجا توان بست؟
کِش صد هزار منزل بیش است در بِدایت
هر چند بردی آبم، روی از دَرَت نَتابم
جور از حبیب خوشتر کز مُدَّعی رعایت
عشقت رِسَد به فریاد ار خود به سانِ حافظ
قرآن ز بَر بخوانی در چاردَه روایت
""",

"غزل۹۵" : """مدامم مست می‌دارد نسیمِ جَعدِ گیسویت
خرابم می‌کند هر دَم، فریبِ چشمِ جادویت
پس از چندین شکیبایی شبی یا رب توان دیدن
که شمعِ دیده افروزیم در محرابِ ابرویت
سوادِ لوح بینش را عزیز از بهر آن دارم
که جان را نسخه‌ای باشد ز لوحِ خالِ هندویت
تو گر خواهی که جاویدان جهان یکسر بیارایی
صبا را گو که بردارد زمانی بُرقِع از رویت
و گر رسمِ فنا خواهی که از عالم براندازی
برافشان تا فروریزد هزاران جان ز هر مویت
من و بادِ صبا مِسکین دو سرگردانِ بی‌حاصل
من از افسونِ چشمت مست و او از بویِ گیسویت
زهی همت که حافظ راست از دنیی و از عقبی
نیاید هیچ در چشمش به جز خاکِ سرِ کویت
""",

"غزل۹۶" : """دردِ ما را نیست درمان الغیاث
هجرِ ما را نیست پایان الغیاث
دین و دل بردند و قصدِ جان کنند
الغیاث از جورِ خوبان، الغیاث
در بهایِ بوسه‌ای جانی طلب
می‌کنند این دلسِتانان الغیاث
خونِ ما خوردند این کافردلان
ای مسلمانان چه درمان؟ الغیاث
همچو حافظ روز و شب بی خویشتن
گشته‌ام سوزان و گریان الغیاث
""",

"غزل۹۷" : """تویی که بر سرِ خوبانِ کشوری چون تاج
سِزَد اگر همهٔ دلبران دَهَندَت باج
دو چشمِ شوخِ تو برهم زده خَطا و حَبَش
به چینِ زلفِ تو ماچین و هند داده خراج
بیاضِ رویِ تو روشن چو عارِضِ رُخِ روز
سوادِ زلفِ سیاهِ تو هست ظلمت داج
دهانِ شهدِ تو داده رواج آب خِضِر
لبِ چو قندِ تو بُرد از نباتِ مصر رواج
از این مرض به حقیقت شفا نخواهم یافت
که از تو دردِ دل ای جان، نمی‌رسد به عِلاج
چرا همی‌شکنی جانِ من ز سنگدلی؟
دلِ ضعیف که باشد، به نازکی چو زُجاج
لبِ تو خضر و دهانِ تو آبِ حیوان است
قدِ تو سرو و میان موی و بَر، به هیئت عاج
فِتاد در دلِ حافظ هوایِ چون تو شَهی
کمینه ذرهٔ خاکِ درِ تو بودی کاج
""",

"غزل۹۸" : """اگر به مذهبِ تو خونِ عاشق است مُباح
صلاحِ ما همه آن است کان تو راست صلاح
سَوادِ زلفِ سیاهِ تو جاعِلُ الظُّلُمات
بَیاضِ رویِ چو ماهِ تو، فالِقُ الاَصباح
ز چینِ زلفِ کمندت کسی نیافت خلاص
از آن کمانچهٔ ابرو و تیرِ چشم، نَجاح
ز دیده‌ام شده یک چشمه در کنار روان
که آشنا نکند در میان آن، مَلّاح
لبِ چو آبِ حیاتِ تو هست قُوَّتِ جان
وجودِ خاکیِ ما را از اوست ذکرِ رَواح
بداد لعلِ لبت بوسه‌ای به صد زاری
گرفت کام دلم زو به صد هزار اِلحاح
دعای جانِ تو وردِ زبان مشتاقان
همیشه تا که بُوَد متصل مَسا و صَباح
صَلاح و توبه و تقوی ز ما مجو حافظ
ز رند و عاشق و مجنون کسی نیافت صلاح
""",

"غزل۹۹" : """دلِ من در هوایِ روی فَرُّخ
بُوَد آشفته همچون مویِ فَرُّخ
بجز هندویِ زلفش هیچ کس نیست
که برخوردار شد از روی فَرُّخ
سیاهی نیکبخت است آن که دایم
بُوَد همراز و هم زانوی فَرُّخ
شَوَد چون بید لرزان سروِ آزاد
اگر بیند قدِ دلجویِ فَرُّخ
بده ساقی شرابِ ارغوانی
به یادِ نرگسِ جادوی فَرُّخ
دوتا شد قامتم همچون کمانی
ز غم پیوسته چون ابروی فَرُّخ
نسیم مُشک تاتاری خِجِل کرد
شمیم زلف عَنبربوی فَرُّخ
اگر میلِ دلِ هر کس به جایست
بُوَد میلِ دلِ من سوی فَرُّخ
غلامِ همتِ آنم که باشد
چو حافظ بنده و هندوی فَرُّخ
""",

"غزل۱۰۰" : """دی پیر می‌فروش که ذکرش به خیر باد
گفتا شراب نوش و غمِ دل بِبَر ز یاد
گفتم به باد می‌دهدم باده نام و ننگ
گفتا قبول کن سخن و هر چه باد، باد
سود و زیان و مایه چو خواهد شدن ز دست
از بهر این معامله غمگین مباش و شاد
بادت به دست باشد اگر دل نهی به هیچ
در معرضی که تخت سلیمان رَوَد به باد
حافظ گرت ز پندِ حکیمان مَلالت است
کوته کنیم قصه، که عمرت دراز باد
"""
}