Divan_e_Hafez = {

        "1":"سید علی آزیز" ,
        "ghazal_1": """اَلا یا اَیُّهَا السّاقی اَدِرْ کَأسَاً و ناوِلْها
که عشق آسان نمود اوّل ولی افتاد مشکل‌ها
به بویِ نافه‌ای کآخر صبا زان طُرّه بگشاید
ز تابِ جَعدِ مشکینش چه خون افتاد در دل‌ها
مرا در منزلِ جانان چه امنِ عیش چون هر دَم
جَرَس فریاد می‌دارد که بَربندید مَحمِل‌ها
به مِی سجّاده رنگین کن گَرت پیرِ مُغان گوید
که سالِک بی‌خبر نَبوَد ز راه و رسمِ منزل‌ها
شبِ تاریک و بیمِ موج و گردابی چنین هایل
کجا دانند حالِ ما سبکبارانِ ساحل‌ها
همه کارم ز خودکامی به بدنامی کشید آخر
نهان کِی مانَد آن رازی کزو سازند محفل‌ها
حضوری گر همی‌خواهی از او غایب مشو حافظ
مَتٰی ما تَلْقَ مَنْ تَهْویٰ دَعِ الدُّنْیا و اَهْمِلْها""",

        "ghazal_2": """صلاحِ کار کجا و منِ خراب کجا
ببین تفاوتِ ره کز کجاست تا به کجا
دلم ز صومعه بگرفت و خِرقِهٔ سالوس
کجاست دیرِ مُغان و شرابِ ناب کجا
چه نسبت است به‌رندی صَلاح و تقوا را
سماعِ وعظ کجا نغمهٔ رباب کجا
ز رویِ دوست دلِ دشمنان چه دریابد
چراغِ مرده کجا شمعِ آفتاب کجا
چو کُحلِ بینشِ ما خاکِ آستانِ شماست
کجا رویم بفرما ازین جناب کجا
مبین به سیبِ زَنَخدان که چاه در راه است
کجا همی‌ روی ای دل بدین شتاب کجا
بشد که یاد خوشش باد روزگارِ وصال
خود آن کرشمه کجا رفت و آن عِتاب کجا
قرار و خواب ز حافظ طمع مدار ای دوست
قرار چیست صبوری کدام و خواب کجا""",

        "ghazal_3": """اگر آن تُرک شیرازی به دست آرد دل ما را
به خال هِندویَش بخشم سمرقند و بخارا را
بده ساقی مِیِ باقی که در جنت نخواهی یافت
کنار آب رُکن آباد و گُلگَشت مُصَلّا را
فَغان کاین لولیانِ شوخِ شیرین‌کار شهرآشوب
چنان بردند صبر از دل که تُرکان خوان یغما را
ز عشق ناتمام ما جمال یار مُستَغنی است
به آب و رنگ و خال و خط چه حاجت روی زیبا را؟
من از آن حسن روزافزون که یوسف داشت دانستم
که عشق از پردهٔ عصمت برون آرد زلیخا را
اگر دشنام فرمایی و گر نفرین، دعا گویم
جواب تلخ می‌زیبد، لب لعل شکرخا را
نصیحت گوش کن جانا که از جان دوست‌تر دارند
جوانان سعادتمند پند پیر دانا را
حدیث از مطرب و مِی گو و راز دَهر کمتر جو
که کس نگشود و نگشاید به حکمت این معما را
غزل گفتی و دُر سفتی، بیا و خوش بخوان حافظ
که بر نظم تو افشاند فلک عِقد ثریا را""" 

}
