Divan_e_Hafez = {
        "غزل۱": """اَلا یا اَیُّهَا السّاقی اَدِرْ کَأسَاً و ناوِلْها
که عشق آسان نمود اوّل ولی افتاد مشکل‌ها
به بویِ نافه‌ای کآخر صبا زان طُرّه بگشاید
ز تابِ جَعدِ مشکینش چه خون افتاد در دل‌ها
مرا در منزلِ جانان چه امنِ عیش چون هر دَم
جَرَس فریاد می‌دارد که بَربندید مَحمِل‌ها
به مِی سجّاده رنگین کن گَرت پیرِ مُغان گوید
که سالِک بی‌خبر نَبوَد ز راه و رسمِ منزل‌ها
شبِ تاریک و بیمِ موج و گردابی چنین هایل
کجا دانند حالِ ما سبکبارانِ ساحل‌ها
همه کارم ز خودکامی به بدنامی کشید آخر
نهان کِی مانَد آن رازی کزو سازند محفل‌ها
حضوری گر همی‌خواهی از او غایب مشو حافظ
مَتٰی ما تَلْقَ مَنْ تَهْویٰ دَعِ الدُّنْیا و اَهْمِلْها""",

        "غزل۲": """صلاحِ کار کجا و منِ خراب کجا
ببین تفاوتِ ره کز کجاست تا به کجا
دلم ز صومعه بگرفت و خِرقِهٔ سالوس
کجاست دیرِ مُغان و شرابِ ناب کجا
چه نسبت است به‌رندی صَلاح و تقوا را
سماعِ وعظ کجا نغمهٔ رباب کجا
ز رویِ دوست دلِ دشمنان چه دریابد
چراغِ مرده کجا شمعِ آفتاب کجا
چو کُحلِ بینشِ ما خاکِ آستانِ شماست
کجا رویم بفرما ازین جناب کجا
مبین به سیبِ زَنَخدان که چاه در راه است
کجا همی‌ روی ای دل بدین شتاب کجا
بشد که یاد خوشش باد روزگارِ وصال
خود آن کرشمه کجا رفت و آن عِتاب کجا
قرار و خواب ز حافظ طمع مدار ای دوست
قرار چیست صبوری کدام و خواب کجا""",

        "غرل۳": """اگر آن تُرک شیرازی به دست آرد دل ما را
به خال هِندویَش بخشم سمرقند و بخارا را
بده ساقی مِیِ باقی که در جنت نخواهی یافت
کنار آب رُکن آباد و گُلگَشت مُصَلّا را
فَغان کاین لولیانِ شوخِ شیرین‌کار شهرآشوب
چنان بردند صبر از دل که تُرکان خوان یغما را
ز عشق ناتمام ما جمال یار مُستَغنی است
به آب و رنگ و خال و خط چه حاجت روی زیبا را؟
من از آن حسن روزافزون که یوسف داشت دانستم
که عشق از پردهٔ عصمت برون آرد زلیخا را
اگر دشنام فرمایی و گر نفرین، دعا گویم
جواب تلخ می‌زیبد، لب لعل شکرخا را
نصیحت گوش کن جانا که از جان دوست‌تر دارند
جوانان سعادتمند پند پیر دانا را
حدیث از مطرب و مِی گو و راز دَهر کمتر جو
که کس نگشود و نگشاید به حکمت این معما را
غزل گفتی و دُر سفتی، بیا و خوش بخوان حافظ
که بر نظم تو افشاند فلک عِقد ثریا را""",

"غزل۴" : """صبا به لطف بگو آن غزال رعنا را
که سر به کوه و بیابان تو داده‌ای ما را
شکرفروش که عمرش دراز باد چرا
تَفَقُّدی نکند طوطی شکرخا را
غرور حُسنت اجازت مگر نداد ای گل؟
که پرسشی نکنی عَندَلیب شیدا را
به خُلق و لطف توان کرد صید اهل نظر
به بند و دام نگیرند مرغ دانا را
ندانم از چه سبب رنگ آشنایی نیست
سَهی‌ قدانِ سیَه‌ چشمِ ماه‌ سیما را
چو با حبیب نشینی و باده پیمایی
به یاد دار مُحِبّان بادپیما را
جز این قَدَر نتوان گفت در جمال تو عیب
که وضع مِهر و وفا نیست روی زیبا را
در آسمان نه عجب گر به گفتهٔ حافظ
سرود زُهره به رقص آورد مسیحا را
""",

"غزل۵" : """دل می‌رود ز دستم صاحب‌دلان خدا را
دردا که راز پنهان خواهد شد آشکارا
کشتی‌شکستگانیم ای باد شُرطِه برخیز
باشد که باز بینم دیدار آشنا را
ده‌روزه مِهر گردون، افسانه است و افسون
نیکی به جای یاران فرصت شمار یارا
در حلقهٔ گل‌ و مُل خوش خواند دوش بلبل
هاتِ الصَّبُوحَ هُبّوا یا ایُّها السُکارا
ای صاحب کرامت شکرانهٔ سلامت
روزی تَفَقُّدی کن درویش بی‌نوا را
آسایش دو گیتی تفسیر این دو حرف است
با دوستان مروت با دشمنان مدارا
در کوی نیک‌نامی ما را گذر ندادند
گر تو نمی‌پسندی تغییر کن قضا را
آن تلخ‌وَش که صوفی ام‌ُّالخَبائِثَش خواند
اَشهی لَنا و اَحلی مِن قُبلَةِ العَذارا
هنگام تنگ‌دستی در عیش کوش و مستی
کاین کیمیای هستی قارون کُنَد گدا را
سرکش مشو که چون شمع از غیرتت بسوزد
دلبر که در کف او موم است سنگ خارا
آیینهٔ سکندر، جام می است بنگر
تا بر تو عرضه دارد احوال مُلک دارا
خوبان پارسی‌گو، بخشندگان عمرند
ساقی بده بشارت رندان پارسا را
حافظ به خود نپوشید این خرقهٔ مِی‌ْآلود
ای شیخ پاک‌دامن معذور دار ما را
""",

"غزل۶" : """به ملازمان سلطان که رساند این دعا را؟
که به شُکرِ پادشاهی ز نظر مران گدا را
ز رقیب دیوسیرت به خدای خود پناهم
مگر آن شهاب ثاقب مددی دهد خدا را
مژهٔ سیاهت ار کرد به خون ما اشارت
ز فریب او بیندیش و غلط مکن نگارا
دل عالمی بسوزی چو عِذار برفُروزی
تو از این چه سود داری که نمی‌کنی مدارا
همه شب در این امیدم که نسیم صبحگاهی
به پیام آشنایان بنوازد آشنا را
چه قیامت است جانا که به عاشقان نمودی؟
دل و جان فدای رویت بنما عِذار ما را
به خدا که جرعه‌ای ده تو به حافظ سحرخیز
که دعای صبحگاهی اثری کند شما را
""",

"غزل۷" : """صوفی بیا که آینه صافیست جام را
تا بنگری صفای می لعل‌فام را
راز درون پرده ز رندان مست پرس
کاین حال نیست زاهد عالی‌مقام را
عَنقا شکار کَس نشود دام بازچین
کآنجا همیشه باد به دست است، دام را
در بزم دور، یک‌دو قدح درکش و برو
یعنی طمع مدار وصال دوام را
ای دل شباب رفت و نچیدی گلی ز عیش
پیرانه‌سر مکن هنری ننگ و نام را
در عیش نقد کوش که چون آبخور نماند
آدمْ بهشتْ، روضهٔ دارُالسَلام را
ما را بر آستان تو بس حق خدمت است
ای خواجه بازبین به تَرَحُّم غلام را
حافظ مرید جام می است ای صبا برو
وز بنده بندگی برسان شیخ جام را
""",

"غزل۸" : """ساقیا برخیز و دَردِه جام را
خاک بر سر کن غم ایام را
ساغر می بر کفم نِه تا ز بَر
بَرکِشم این دلق اَزرَق‌فام را
گر چه بدنامی‌ست نزد عاقلان
ما نمی‌خواهیم ننگ و نام را
باده دَردِه چند از این باد غرور
خاک بر سر نفس نافرجام را
دود آه سینهٔ نالان من
سوخت این افسردگان خام را
محرم راز دل شیدای خود
کس نمی‌بینم ز خاص و عام را
با دلارامی مرا خاطر خوش است
کز دلم یک باره بُرد آرام را
ننگرد دیگر به سرو اندر چمن
هرکه دید آن سرو سیم‌اندام را
صبر کن حافظ به سختی روز و شب
عاقبت روزی بیابی کام را
""",

"غزل۹" : """رونق عهد شباب است دگر بُستان را
می‌رسد مژدهٔ گل بلبل خوش الحان را
ای صبا گر به جوانان چمن باز رَسی
خدمت ما برسان سرو و گل و ریحان را
گر چنین جلوه کند مغبچهٔ باده فروش
خاک‌روب در میخانه کنم مژگان را
ای که بر مه کشی از عَنبر سارا چوگان
مضطرب حال مگردان، من سرگردان را
ترسم این قوم که بر دُردکشان می‌خندند
در سر کار خرابات کنند ایمان را
یار مردان خدا باش که در کشتی نوح
هست خاکی که به آبی نخرد طوفان را
برو از خانهٔ گردون به در و نان مطلب
کان سیه کاسه در آخر بِکُشد مهمان را
هر که را خوابگه آخر مشتی خاک است
گو چه حاجت که به افلاک کشی ایوان را
ماه کنعانی من! مسند مصر آنِ تو شد
وقت آن است که بدرود کنی زندان را
حافظا می خور و رندی کن و خوش باش ولی
دام تزویر مکن چون دگران قرآن را
""",

"غزل۱۰" : """دوش از مسجد سوی میخانه آمد پیر ما
چیست یاران طریقت بعد از این تدبیر ما
ما مریدان روی سوی قبله چون آریم چون
روی سوی خانهٔ خَمّار دارد پیر ما
در خرابات طریقت ما به هم منزل شویم
کاین چنین رفته‌ست در عهد ازل تقدیر ما
عقل اگر داند که دل در بند زلفش چون خوش است
عاقلان دیوانه گردند از پی زنجیر ما
روی خوبت آیتی از لطف بر ما کشف کرد
زان زمان جز لطف و خوبی نیست در تفسیر ما
با دل سنگینت آیا هیچ درگیرد شبی؟
آه آتشناک و سوز سینهٔ شبگیر ما
تیر آه ما ز گردون بگذرد حافظ خموش
رحم کن بر جان خود پرهیز کن از تیر ما
""",

"غزل۱۱" : """ساقی به نور باده برافروز جامِ ما
مطرب بگو که کارِ جهان شُد به کامِ ما
ما در پیاله عکس رخ یار دیده‌ایم
ای بی‌خبر ز لذتِ شربِ مدامِ ما
هرگز نمیرد آن که دلش زنده شد به عشق
ثبت است بر جریدهٔ عالم دوام ما
چندان بُوَد کرشمه و نازِ سَهی‌قدان
کآید به جلوه سرو صنوبرخرام ما
ای باد اگر به گلشن اَحباب بگذری
زنهار عرضه دِه بَرِ جانان پیام ما
گو نام ما ز یاد به عمداً چه می‌بری؟!
خود آید آن که یاد نیاری ز نام ما
مستی به چشمِ شاهدِ دلبندِ ما خوش است
زآن رو سپرده‌اند به مستی زمام ما
ترسم که صرفه‌ای نَبَرَد روز بازخواست
نانِ حلالِ شیخ، ز آب حرام ما
حافظ ز دیده، دانهٔ اشکی همی‌فشان
باشد که مرغِ وصل کُند قصدِ دام ما
دریای اخضر فلک و کشتی هلال
هستند غرق نعمت حاجی‌قوام ما
""",

"غزل۱۲" : """ای فروغِ ماهِ حُسن، از روی رخشان شما
آبروی خوبی از چاه زَنَخدان شما
عزم دیدار تو دارد جانِ بر لب آمده
باز گردد یا برآید؟ چیست فرمان شما؟
کَس به دور نرگست طرفی نبست از عافیت
بِه که نفروشند مستوری به مستان شما
بخت خواب آلود ما بیدار خواهد شد مگر
زان که زد بر دیده آبی، روی رخشان شما
با صبا همراه بفرست از رخت گل دسته‌ای
بو که بویی بشنویم از خاک بستان شما
عمرتان باد و مراد ای ساقیانِ بزمِ جم
گر چه جام ما نشد پُر مِی به دوران شما
دل خرابی می‌کند، دلدار را آگه کنید
زینهار ای دوستان جان من و جان شما
کی دهد دست این غرض یا رب که همدستان شوند
خاطر مجموع ما، زلف پریشان شما
دور دار از خاک و خون دامن، چو بر ما بگذری
کاندر این ره کشته بسیارند، قربان شما
می‌کند حافظ دعایی، بشنو، آمینی بگو
روزی ما باد لعل شَکَّرافشان شما
ای صبا با ساکنانِ شهرِ یزد از ما بگو
کای سر حق ناشناسان گوی چوگان شما
گر چه دوریم از بساط قرب، همت دور نیست
بندهٔ شاه شماییم و ثناخوان شما
ای شَهنشاه بلند اختر، خدا را همتی
تا ببوسم همچو اختر خاک ایوان شما
""",

"غزل۱۳" : """می‌دمد صبح و کِلِّه بست سحاب
الصَبوح الصَبوح یا اصحاب
می‌چکد ژاله بر رخِ لاله
المُدام المُدام یا احباب
می‌وزد از چمن نسیمِ بهشت
هان، بنوشید دَم به دَم مِیِ ناب
تخت زُمْرُد زده است گل به چمن
راحِ چون لعلِ آتشین دریاب
درِ میخانه بسته‌اند دگر
اِفتَتِح یا مُفَتِّح الاَبواب
لب و دَندانْت را حقوق نمک
هست بر جان و سینه‌هایِ کباب
این چنین موسمی عجب باشد
که ببندند میکده به شتاب
بر رخِ ساقی پری پیکر
همچو حافظ بنوش بادهٔ ناب
""",

"غزل۱۴" : """گفتم ای سلطانِ خوبان رحم کن بر این غریب
گفت در دنبالِ دل، رَه گُم کُنَد مسکین غریب
گفتمش مَگذر زمانی، گفت معذورم بدار
خانه پروردی، چه تاب آرد غم چندین غریب
خفته بر سنجابِ شاهی نازنینی را چه غم؟
گر ز خار و خاره سازد بستر و بالین غریب
ای که در زنجیرِ زلفت جایِ چندین آشناست
خوش فتاد آن خالِ مشکین بر رخِ رنگین غریب
می‌نماید عکسِ مِی، در رنگِ رویِ مَه وَشَت
همچو برگِ ارغوان بر صفحهٔ نسرین، غریب
بس غریب افتاده است آن مور خَط، گِردِ رُخَت
گر چه نَبوَد در نگارستان، خطِ مشکین غریب
گفتم ای شامِ غریبان طُرِّهٔ شبرنگِ تو
در سحرگاهان حذر کن، چون بنالد این غریب
گفت حافظ آشنایان در مقامِ حیرتند
دور نَبوَد گر نشیند خسته و مسکین غریب
""",

"غزل۱۵" : """ای شاهد قدسی، کِه کَشَد بند نقابت؟
وی مرغ بهشتی، که دهد دانه و آبت؟
خوابم بشد از دیده در این فکر جگرسوز
کآغوش که شد، منزل آسایش و خوابت؟
درویش نمی‌پرسی و ترسم که نباشد
اندیشهٔ آمرزش و پروای ثوابت
راه دل عشاق زد آن چشم خماری
پیداست از این شیوه که مست است شرابت
تیری که زدی بر دلم از غمزه، خطا رفت
تا باز چه اندیشه کند رای صوابت
هر ناله و فریاد که کردم نشنیدی
پیداست نگارا که بلند است جَنابت
دور است سر آب از این بادیه، هش دار
تا غول بیابان نفریبد به سرابت
تا در ره پیری به چه آیین رَوی ای دل
باری به غلط صرف شد ایام شبابت
ای قصرِ دل افروز که منزلگه انسی
یا رب مَکُناد آفت ایام خرابت
حافظ نه غلامیست که از خواجه گریزد
صلحی کن و بازآ که خرابم ز عِتابت
""",

"غزل۱۶" : """خَمی که ابروی شوخِ تو در کمان انداخت
به قصد جانِ منِ زارِ ناتوان انداخت
نبود نقش دو عالم، که رنگ الفت بود
زمانه طرح محبت، نه این زمان انداخت
به یک کرشمه که نرگس به خودفروشی کرد
فریبِ چشمِ تو صد فتنه در جهان انداخت
شراب خورده و خِوی کرده می‌روی به چمن
که آبِ روی تو، آتش در ارغوان انداخت
به بزمگاهِ چمن دوش مست بگذشتم
چو از دهانِ توام غنچه در گمان انداخت
بنفشه طُرِّه مفتول خود گره می‌زد
صبا حکایتِ زلفِ تو در میان انداخت
ز شرمِ آن که به روی تو نسبتش کردم
سمن به دستِ صبا، خاک در دهان انداخت
من از ورع، مِی و مطرب ندیدمی زین پیش
هوای مغبچگانم در این و آن انداخت
کنون به آبِ مِی لعل، خرقه می‌شویم
نصیبهٔ ازل از خود، نمی‌توان انداخت
مگر گشایش حافظ در این خرابی بود؟
که بخششِ ازلش، در می مغان انداخت
جهان به کامِ من اکنون شود، که دور زمان
مرا به بندگیِ خواجهٔ جهان انداخت
""",

"غزل۱۷" : """سینه از آتش دل، در غم جانانه بسوخت
آتشی بود در این خانه، که کاشانه بسوخت
تنم از واسطهٔ دوری دلبر بگداخت
جانم از آتشِ مهرِ رخِ جانانه بسوخت
سوز دل بین که ز بس آتش اشکم، دل شمع
دوش بر من ز سر مِهر، چو پروانه بسوخت
آشنایی نه غریب است، که دلسوز من است
چون من از خویش برفتم، دل بیگانه بسوخت
خرقهٔ زهدِ مرا، آب خرابات ببرد
خانهٔ عقلِ مرا، آتش میخانه بسوخت
چون پیاله دلم از توبه که کردم بشکست
همچو لاله، جگرم بی می و خُمخانه بسوخت
ماجرا کم کن و بازآ که مرا مردم چشم
خرقه از سر به درآورد و به شکرانه بسوخت
ترک افسانه بگو حافظ و می نوش دمی
که نَخُفتیم شب و شمع به افسانه بسوخت
""",

"غزل۱۸" : """ساقیا آمدنِ عید، مبارک بادت
وان مَواعید که کردی، مَرَواد از یادت
در شگفتم که در این مدتِ ایامِ فراق
برگرفتی ز حریفان دل و دل می‌دادت
برسان بندگیِ دختر رَز، گو به درآی
که دَمُ و همت ما کرد ز بند آزادت
شادی مجلسیان در قدم و مقدم توست
جای غم باد، مَر آن دل، که نخواهد شادت
شکر ایزد که ز تاراجِ خزان رخنه نیافت
بوستان سمن و سرو و گل و شمشادت
چشم بد دور کز آن تفرقه‌ات بازآورد
طالع نامور و دولت مادرزادت
حافظ از دست مده دولت این کشتی نوح
ور نه طوفانِ حوادث بِبَرَد بُنیادت
""",

"غزل۱۹" : """ای نسیم سحر آرامگَهِ یار کجاست؟
منزلِ آن مَهِ عاشق‌کُشِ عیار کجاست؟
شبِ تار است و رَه وادیِ اِیمن در پیش
آتش طور کجا؟ موعد دیدار کجاست؟
هر که آمد به جهان نقش خرابی دارد
در خرابات بگویید که هشیار کجاست؟
آن کَس است اهل بشارت که اشارت داند
نکته‌ها هست بسی محرم اسرار کجاست؟
هر سرِ مویِ مرا با تو هزاران کار است
ما کجاییم و ملامت‌گر بی‌کار کجاست؟
باز پرسید ز گیسویِ شِکَن در شِکَنَش
کاین دل غم‌زده، سرگشته گرفتار، کجاست؟
عقل دیوانه شد آن سلسله مشکین کو؟
دل ز ما گوشه گرفت ابروی دلدار کجاست؟
ساقی و مطرب و می جمله مهیاست ولی
عیش، بی یار مهیا نشود یار کجاست؟
حافظ از بادِ خزان، در چمنِ دهر مَرَنج
فکرِ معقول بفرما، گلِ بی خار کجاست؟
""",

"غزل۲۰" : """روزه یک سو شد و عید آمد و دل‌ها برخاست
می ز خُمخانه به جوش آمد و می‌باید خواست
نوبهٔ زهدفروشانِ گران جان بگذشت
وقتِ رندی و طرب کردن رندان پیداست
چه ملامت بود آن را که چنین باده خورَد؟
این چه عیب است بدین بی‌خردی، وین چه خطاست؟
باده نوشی که در او روی و ریایی نَبُوَد
بهتر از زهدفروشی، که در او روی و ریاست
ما نه رندان ریاییم و حریفان نفاق
آن که او عالِم سِرّ است، بدین حال گواست
فرض ایزد بگزاریم و به کس بد نکنیم
وان چه گویند روا نیست، نگوییم رواست
چه شود گر من و تو چند قدح باده خوریم؟
باده از خون رَزان است، نه از خون شماست
این چه عیب است کز آن عیب خلل خواهد بود
ور بُوَد نیز چه شد؟ مردم بی‌عیب کجاست
""",

"غزل۲۱" : """دل و دینم شد و دلبر به ملامت برخاست
گفت با ما منشین کز تو سلامت برخاست
که شنیدی که در این بزم دمی خوش بنشست
که نه در آخر صحبت به ندامت برخاست
شمع اگر زان لب خندان به زبان لافی زد
پیش عشاق تو شب‌ها به غرامت برخاست
در چمن باد بهاری ز کنار گل و سرو
به هواداری آن عارض و قامت برخاست
مست بگذشتی و از خلوتیان ملکوت
به تماشای تو آشوب قیامت برخاست
پیش رفتار تو پا برنگرفت از خجلت
سرو سرکش که به ناز از قد و قامت برخاست
حافظ این خرقه بینداز مگر جان ببری
کاتش از خرقه سالوس و کرامت برخاست
""",

"غزل۲۲" : """چو بشنوی سخن اهل دل مگو که خطاست
سخن شناس نه‌ای جان من، خطا این جاست
سرم به دنیی و عقبی فرو نمی‌آید
تبارک الله از این فتنه‌ها که در سر ماست
در اندرون من خسته دل ندانم کیست
که من خموشم و او در فغان و در غوغاست
دلم ز پرده برون شد کجایی ای مطرب
بنال، هان که از این پرده کار ما به نواست
مرا به کار جهان هرگز التفات نبود
رخ تو در نظر من چنین خوشش آراست
نخفته‌ام ز خیالی که می‌پزد دل من
خمار صدشبه دارم شرابخانه کجاست
چنین که صومعه آلوده شد ز خون دلم
گرم به باده بشویید حق به دست شماست
از آن به دیرِ مغانم عزیز می‌دارند
که آتشی که نمیرد همیشه در دل ماست
چه ساز بود که در پرده می‌زد آن مطرب
که رفت عمر و هنوزم دِماغ پُر ز هواست
ندای عشق تو دیشب در اندرون دادند
فضای سینه حافظ هنوز پر ز صداست
""",

"غزل۲۳" : """خیالِ رویِ تو در هر طریق همره ماست
نسیم موی تو پیوندِ جانِ آگه ماست
به رغم مدعیانی که منع عشق کنند
جمالِ چهرهٔ تو حجت موجه ماست
ببین که سیب زنخدان تو چه می‌گوید
هزار یوسف مصری فتاده در چَهِ ماست
اگر به زلف دراز تو دست ما نرسد
گناه بخت پریشان و دست کوته ماست
به حاجبِ درِ خلوت سرایِ خاص بگو
فُلان ز گوشه نشینانِ خاکِ درگهِ ماست
به صورت از نظر ما اگر چه محجوب است
همیشه در نظرِ خاطرِ مرفهِ ماست
اگر به سالی حافظ دری زند بگشای
که سال‌هاست که مشتاق روی چون مه ماست
""",

"غزل۲۴" : """مطلب طاعت و پیمان و صلاح از منِ مست
که به پیمانه کشی شهره شدم روز الست
من همان دم که وضو ساختم از چشمه عشق
چارتکبیر زدم یکسره بر هر چه که هست
می بده تا دهمت آگهی از سِرِّ قضا
که به رویِ که شدم عاشق و از بوی که مست
کمر کوه کم است از کمر مور این جا
ناامید از در رحمت مشو ای باده پرست
به جز آن نرگس مستانه که چشمش مَرِساد
زیر این طارِم فیروزه کسی خوش ننشست
جان فدای دهنش باد که در باغ نظر
چمن آرای جهان خوشتر از این غنچه نبست
حافظ از دولت عشق تو سلیمانی شد
یعنی از وصل تواش نیست به جز باد به دست
""",

"غزل۲۵" : """شکفته شد گل حَمرا و گشت بلبل مست
صلایِ سرخوشی، ای صوفیان باده پرست
اساس توبه که در محکمی چو سنگ نمود
ببین که جام زُجاجی چه طُرفه‌اش بشکست
بیار باده که در بارگاه استغنا
چه پاسبان و چه سلطان، چه هوشیار و چه مست
از این رِباط دودر، چون ضرورت است رَحیل
رِواق و طاقِ معیشت، چه سربلند و چه پست
مقام عیش میسر نمی‌شود بی‌رنج
بلی به حکم بلا بسته‌اند عهد الست
به هست و نیست مرنجان ضمیر و خوش می‌باش
که نیستی است سرانجام هر کمال که هست
شکوه آصفی و اسب باد و منطق طیر
به باد رفت و از او خواجه هیچ طَرف نبست
به بال و پَر مرو از ره که تیر پرتابی
هوا گرفت زمانی، ولی به خاک نشست
زبان کِلکِ تو حافظ چه شکر آن گوید
که گفتهٔ سخنت می‌برند دست به دست
""",

"غزل۲۶" : """زلف‌آشفته و خِوی‌کرده و خندان‌لب و مست
پیرهن‌چاک و غزل‌خوان و صُراحی در دست
نرگسش عربده‌جوی و لبش افسوس‌کنان
نیم شب دوش به بالین من آمد بنشست
سر فرا گوش من آورد به آواز حزین
گفت ای عاشق دیرینهٔ من خوابت هست؟
عاشقی را که چنین بادهٔ شبگیر دهند
کافر عشق بود گر نشود باده پرست
برو ای زاهد و بر دُردکشان خرده مگیر
که ندادند جز این تحفه به ما روز الست
آن چه او ریخت به پیمانهٔ ما نوشیدیم
اگر از خَمر بهشت است وگر بادهٔ مست
خندهٔ جامِ می و زلفِ گره‌گیر نگار
ای بسا توبه که چون توبه حافظ بشکست
""",

"غزل۲۷" : """در دیر مغان آمد، یارم قدحی در دست
مست از می و میخواران از نرگس مستش مست
در نعلِ سمندِ او شکلِ مهِ نو پیدا
وز قدِ بلندِ او بالای صنوبر پست
آخر به چه گویم هست از خود خبرم، چون نیست
وز بهر چه گویم نیست با وی نظرم، چون هست
شمع دل دمسازم، بنشست چو او برخاست
و افغان ز نظربازان، برخاست چو او بنشست
گر غالیه خوش بو شد، در گیسوی او پیچید
ور وَسمه کمانکش گشت، در ابروی او پیوست
بازآی که بازآید عمرِ شدهٔ حافظ
هر چند که ناید باز، تیری که بشد از شست
""",

"غزل۲۸" : """به جانِ خواجه و حقِ قدیم و عهدِ درست
که مونسِ دمِ صبحم، دعای دولت توست
سرشک من که ز طوفان نوح دست بَرَد
ز لوح سینه نیارَست نقشِ مهرِ تو شُست
بکن معامله‌ای، وین دل شکسته بخر
که با شکستگی ارزد به صد هزار درست
زبان مور به آصف دراز گشت و رواست
که خواجه خاتَمِ جم، یاوه کرد و باز نَجُست
دلا طمع مَبر از لطف بی‌نهایت دوست
چو لاف عشق زدی سر بباز، چابک و چُست
به صدق کوش، که خورشید زایَد از نَفَسَت
که از دروغ سیه روی گشت صبحِ نخست
شدم ز دست تو شیدای کوه و دشت و هنوز
نمی‌کنی به ترحم، نِطاق سلسله سست
مرنج حافظ و از دلبران حِفاظ مجوی
گناه باغ چه باشد چو این گیاه نَرُست
""",

"غزل۲۹" : """ما را ز خیال تو چه پروای شراب است؟
خُم گو سر خود گیر، که خُمخانه خراب است
گر خَمر بهشت است بریزید که بی دوست
هر شربت عَذبَم که دهی، عین عذاب است
افسوس که شُد دلبر و در دیدهٔ گریان
تحریرِ خیالِ خطِ او نقشِ بر آب است
بیدار شو ای دیده که ایمن نتوان بود
زین سیل دمادم که در این منزل خواب است
معشوق عیان می‌گذرد بر تو، ولیکن
اغیار همی‌بیند از آن بسته نقاب است
گل بر رخ رنگین تو تا لطف عرق دید
در آتش شوق از غم دل، غرق گلاب است
سبز است در و دشت بیا تا نگذاریم
دست از سر آبی که جهان جمله سراب است
در کُنجِ دِماغم مطلب جای نصیحت
کاین گوشه پر از زمزمهٔ چنگ و رَباب است
حافظ چه شد ار عاشق و رند است و نظرباز
بس طورِ عجب، لازم ایام شباب است
""",

"غزل۳۰" : """زلفت هزار دل به یکی تار مو ببست
راه هزار چاره‌گر از چار سو ببست
تا عاشقان به بوی نسیمش دهند جان
بگشود نافه‌ایُّ و دَرِ آرزو ببست
شیدا از آن شدم که نگارم چو ماه نو
ابرو نمود و جلوه‌گری کرد و رو ببست
ساقی به چند رنگ، می اندر پیاله ریخت
این نقش‌ها نگر، که چه خوش در کدو ببست
یا رب چه غمزه کرد صُراحی که خون خُم
با نعره‌های قُلقُلش اندر گلو ببست
مطرب چه پرده ساخت که در پردهٔ سماع
بر اهل وجد و حال، درِ های و هو ببست
حافظ! هر آن که عشق نَورزید و وصل خواست
احرامِ طوفِ کعبهٔ دل بی وضو ببست
""",

"غزل۳۱" : """آن شبِ قدری که گویند اهل خلوت امشب است
یا رب این تأثیرِ دولت در کدامین کوکب است؟
تا به گیسوی تو دست ناسزایان کم رسد
هر دلی از حلقه‌ای در ذکر یارب یارب است
کشته چاه زنخدان توام کز هر طرف
صد هزارش گردن جان زیرِ طوقِ غبغب است
شهسوار من که مه آیینه دار روی اوست
تاجِ خورشیدِ بلندش خاکِ نعلِ مرکب است
عکس خِوی بر عارضش بین کآفتاب گرم رو
در هوای آن عرق تا هست هر روزش تب است
من نخواهم کرد ترک لعل یار و جام می
زاهدان معذور داریدم که اینم مذهب است
اندر آن ساعت که بر پشت صبا بندند زین
با سلیمان چون برانم من که مورم مرکب است
آن که ناوک بر دل من زیر چشمی می‌زند
قوتِ جانِ حافظش در خندهٔ زیر لب است
آب حیوانش ز منقار بلاغت می‌چکد
زاغِ کِلکِ من به نام ایزد چه عالی مشرب است
""",

"غزل۳۲" : """خدا چو صورتِ ابرویِ دلگشای تو بست
گشادِ کارِ من اندر کرشمه‌های تو بست
مرا و سرو چمن را به خاک راه نشاند
زمانه تا قَصَبِ نرگس قبای تو بست
ز کار ما و دل غنچه صد گره بگشود
نسیم گل چو دل اندر پی هوای تو بست
مرا به بندِ تو دوران چرخ راضی کرد
ولی چه سود که سررشته در رضای تو بست
چو نافه بر دلِ مسکینِ من گره مفکن
که عهد با سرِ زلفِ گره گشای تو بست
تو خود وصالِ دگر بودی ای نسیم وصال
خطا نگر، که دل امید در وفای تو بست
ز دستِ جورِ تو گفتم ز شهر خواهم رفت
به خنده گفت: که حافظ برو، که پای تو بست؟
""",

"غزل۳۳" : """خلوت گُزیده را به تماشا چه حاجت است
چون کوی دوست هست به صحرا چه حاجت است
جانا به حاجتی که تو را هست با خدا
کآخِر دمی بپرس که ما را چه حاجت است
ای پادشاهِ حُسن خدا را بسوختیم
آخِر سؤال کن که گدا را چه حاجت است
اربابِ حاجتیم و زبان سؤال نیست
در حضرت کریم، تمنا چه حاجت است
محتاج قصه نیست گرت قصدِ خون ماست
چون رخت از آن توست، به یغما چه حاجت است
جامِ جهان نماست ضمیرِ منیرِ دوست
اظهار احتیاج، خود آن جا چه حاجت است
آن شد که بارِ منتِ مَلّاح بردمی
گوهر چو دست داد به دریا چه حاجت است
ای مدعی برو که مرا با تو کار نیست
احباب حاضرند، به اعدا چه حاجت است
ای عاشقِ گدا چو لبِ روح بخش یار
می‌داندت وظیفه، تقاضا چه حاجت است
حافظ! تو ختم کن که هنر خود عیان شود
با مدعی نزاع و مُحاکا چه حاجت است
""",

"غزل۳۴" : """رَواقِ منظرِ چشمِ من آشیانهٔ توست
کَرَم نما و فرود آ که خانه خانهٔ توست
به لطفِ خال و خط از عارفان ربودی دل
لطیفه‌های عجب زیرِ دام و دانهٔ توست
دلت به وصلِ گل ای بلبل صبا خوش باد
که در چمن همه گلبانگ عاشقانهٔ توست
عِلاج ضعفِ دلِ ما به لب حوالت کن
که این مُفَرِّحِ یاقوت، در خزانهٔ توست
به تن مُقصرم از دولتِ ملازمتت
ولی خلاصهٔ جان خاکِ آستانهٔ توست
من آن نِیَم که دهم نقدِ دل به هر شوخی
دَرِ خزانه، به مهر تو و نشانهٔ توست
تو خود چه لعبتی ای شهسوارِ شیرین کار
که توسنی چو فلک، رامِ تازیانهٔ توست
چه جای من، که بلغزد سپهر شعبده باز
از این حیَل که در انبانهٔ بهانهٔ توست
سرودِ مجلست اکنون فلک به رقص آرد
که شعرِ حافظِ شیرین سخن ترانهٔ توست
""",

"غزل۳۵" : """برو به کارِ خود ای واعظ این چه فریادست
مرا فتاد دل از ره، تو را چه افتادست؟
میان او که خدا آفریده است از هیچ
دقیقه‌ایست که هیچ آفریده نگشادست
به کام تا نرساند مرا لبش چون نای
نصیحتِ همه عالم به گوش من بادست
گدای کوی تو از هشت خُلد مستغنیست
اسیرِ عشقِ تو از هر دو عالم آزادست
اگر چه مستی عشقم خراب کرد ولی
اساسِ هستیِ من زان خراب آبادست
دلا منال ز بیداد و جور یار که یار
تو را نصیب همین کرد و این از آن دادست
برو فِسانه مخوان و فسون مدم حافظ
کز این فسانه و افسون مرا بسی یادست
""",

"غزل۳۶" : """تا سرِ زلفِ تو در دست نسیم افتادست
دلِ سودازده از غصه دو نیم افتادست
چَشمِ جادویِ تو خود عینِ سَوادِ سحْر است
لیکن این هست که این نسخه سَقیم افتادست
در خَم زلف تو آن خال سیه دانی چیست؟
نقطهٔ دوده که در حلقه جیم افتادست
زلف مِشکین تو در گلشن فردوسِ عِذار
چیست؟ طاووس که در باغ نعیم افتادست
دلِ من در هوسِ رویِ تو ای مونس جان
خاکِ راهیست که در دستِ نسیم افتادست
همچو گَرد این تنِ خاکی نتوانَد برخاست
از سرِ کویِ تو زان رو که عظیم افتادست
سایهٔ قَدِّ تو بر قالبم ای عیسی دم
عکسِ روحیست که بر عَظمِ رَمیم افتادست
آن که جز کعبه مقامش نَبُد از یادِ لبت
بر درِ میکده دیدم که مقیم افتادست!
حافظِ گمشده را با غمت ای یارِ عزیز
اتحادیست که در عهد قدیم افتادست
""",

"غزل۳۷" : """بیا که قصرِ اَمَل سخت سست بنیادست
بیار باده که بنیادِ عمر بر بادست
غلامِ همتِ آنم که زیرِ چرخِ کبود
ز هر چه رنگِ تعلق پذیرد آزادست
چه گویمت که به میخانه دوش مست و خراب
سروشِ عالَمِ غیبم چه مژده‌ها دادست
که ای بلندنظر شاهبازِ سِدره نشین
نشیمن تو نه این کُنجِ محنت آبادست
تو را ز کنگرهٔ عرش می‌زنند صفیر
ندانمت که در این دامگه چه افتادست
نصیحتی کنمت یاد گیر و در عمل آر
که این حدیث، ز پیرِ طریقتم یادست
غمِ جهان مخور و پندِ من مَبَر از یاد
که این لطیفهٔ عشقم ز رهروی یادست
رضا به داده بده، وز جبین گره بگشای
که بر من و تو دَرِ اختیار نگشادست
مجو درستیِ عهد از جهانِ سست نهاد
که این عجوز، عروس هزاردامادست
نشان عهد و وفا نیست در تبسمِ گل
بنال بلبل بی دل که جای فریادست
حسد چه می‌بری ای سست نظم بر حافظ؟
قبولِ خاطر و لطفِ سخن خدادادست
""",

"غزل۳۸" : """بی مهرِ رُخَت روزِ مرا نور نماندست
وز عمر، مرا جز شبِ دیجور نماندست
هنگامِ وداعِ تو ز بس گریه که کردم
دور از رخِ تو چشمِ مرا نور نماندست
می‌رفت خیالِ تو ز چشمِ من و می‌گفت
هیهات از این گوشه که معمور نماندست
وصلِ تو اجل را ز سرم دور همی‌داشت
از دولتِ هجرِ تو کنون دور نماندست
نزدیک شد آن دم که رقیب تو بگوید
دور از رُخَت این خستهٔ رنجور نماندست
صبر است مرا چارهٔ هجرانِ تو لیکن
چون صبر توان کرد؟ که مقدور نماندست
در هجرِ تو گر چشمِ مرا آبِ روان است
گو خونِ جگر ریز که معذور نماندست
حافظ، ز غم از گریه نپرداخت به خنده
ماتم زده را داعیهٔ سور نماندست
""",

"غزل۳۹" : """باغِ مرا چه حاجتِ سرو و صنوبر است؟
شمشادِ خانه‌پرورِ ما از که کمتر است؟
ای نازنین‌پسر، تو چه مذهب گرفته‌ای؟
کِت خونِ ما حلال‌تر از شیرِ مادر است
چون نقشِ غم ز دور ببینی شراب خواه
تشخیص کرده‌ایم و مداوا مقرّر است
از آستانِ پیرِ مغان سر چرا کشیم؟
دولت در آن سرا و گشایش در آن در است
یک قصّه بیش نیست غمِ عشق، وین عجب
کز هر زبان که می‌شنوم نامکرّر است
دی وعده داد وصلم و در سر شراب داشت
امروز تا چه گوید و بازش چه در سر است
شیراز و آبِ رکنی و این بادِ خوش نسیم
عیبش مکن که خالِ رُخِ هفت کشور است
فرق است از آبِ خضر که ظلمات جای او است
تا آبِ ما که منبعش الله اکبر است
ما آبرویِ فقر و قناعت نمی‌بریم
با پادشه بگوی که روزی مقدّر است
حافظ چه طُرفه شاخ نباتیست کِلکِ تو
کِش میوه دلپذیرتر از شهد و شکّر است
""",

"غزل۴۰" : """اَلمِنَّةُ لِلَّه که درِ میکده باز است
زان رو که مرا بر در او روی نیاز است
خُم‌ها همه در جوش و خروشند ز مستی
وان می که در آن جاست حقیقت، نه مجاز است
از وی همه مستی و غرور است و تکبر
وز ما همه بیچارگی و عجز و نیاز است
رازی که بَرِ غیر نگفتیم و نگوییم
با دوست بگوییم که او محرم راز است
شرحِ شِکَنِ زلفِ خَم اندر خَم جانان
کوته نتوان کرد که این قصه دراز است
بارِ دلِ مجنون و خَمِ طُرِّهٔ لیلی
رخسارهٔ محمود و کفِ پایِ ایاز است
بردوخته‌ام دیده چو باز از همه عالم
تا دیدهٔ من بر رُخِ زیبایِ تو باز است
در کعبهٔ کوی تو هر آن کس که بیاید
از قبلهٔ ابروی تو در عینِ نماز است
ای مجلسیان، سوزِ دلِ حافظِ مسکین
از شمع بپرسید که در سوز و گداز است
""",

"غزل۴۱" : """اگر چه باده فرح بخش و باد گل‌بیز است
به بانگ چنگ مخور می که محتسب تیز است
صراحی‌ای و حریفی گرت به چنگ افتد
به عقل نوش که ایام فتنه‌ انگیز است
در آستین مرقع پیاله پنهان کن
که همچو چشم صراحی زمانه خونریز است
به آب دیده بشوییم خرقه‌ها از می
که موسم ورع و روزگار پرهیز است
مجوی عیش خوش از دور باژگون سپهر
که صاف این سر خم جمله دُردی آمیز است
سپهرِ بر شده پرویزنی‌ست خون افشان
که ریزه‌اش سر کسری و تاجِ پرویز است
عراق و فارس گرفتی به شعر خوش حافظ
بیا که نوبت بغداد و وقت تبریز است
""",

"غزل۴۲" : """حالِ دل با تو گفتنم هوس است
خبرِ دل شِنُفتَنَم هوس است
طمعِ خام بین که قصهٔ فاش
از رقیبان نهفتنم هوس است
شبِ قدری چنین عزیزِ شریف
با تو تا روز خُفتنم هوس است
وه که دُردانه‌ای چنین نازک
در شبِ تار سُفتنم هوس است
ای صبا امشبم مدد فرمای
که سحرگه شکفتنم هوس است
از برای شرف به نوُکِ مژه
خاکِ راهِ تو رفتنم هوس است
همچو حافظ به رغمِ مدعیان
شعرِ رندانه گفتنم هوس است
""",

"غزل۴۳" : """صحنِ بُستان ذوق بخش و صحبتِ یاران خوش است
وقت گل خوش باد کز وی وقتِ میخواران خوش است
از صبا هر دم مشامِ جانِ ما خوش می‌شود
آری آری طیبِ انفاسِ هواداران خوش است
ناگشوده گل نقاب، آهنگِ رحلت ساز کرد
ناله کن بلبل، که گلبانگِ دل افکاران خوش است
مرغِ خوشخوان را بشارت باد کاندر راهِ عشق
دوست را با نالهٔ شب‌های بیداران خوش است
نیست در بازارِ عالَم خوشدلی ور زان که هست
شیوهٔ رندی و خوش باشیِ عیاران خوش است
از زبانِ سوسنِ آزاده‌ام آمد به گوش
کاندر این دیرِ کهن، کارِ سبکباران خوش است
حافظا! تَرکِ جهان گفتن طریقِ خوشدلیست
تا نپنداری که احوالِ جهان داران خوش است
""",

"غزل۴۴" : """کنون که بر کفِ گل جامِ بادهٔ صاف است
به صدهزار زبان بلبلش در اوصاف است
بخواه دفتر اشعار و راهِ صحرا گیر
چه وقتِ مدرسه و بحث کشف کَشّاف است؟
فقیه مدرسه دی مست بود و فتوی داد
که می حرام، ولی بِه ز مالِ اوقاف است
به دُرد و صاف تو را حکم نیست خوش دَرکَش
که هر چه ساقی ما کرد عینِ الطاف است
بِبُر ز خلق و چو عَنقا قیاس کار بگیر
که صیت گوشه‌نشینان ز قاف تا قاف است
حدیثِ مدّعیان و خیالِ همکاران
همان حکایت زردوز و بوریاباف است
خموش حافظ و این نکته‌های چون زر سرخ
نگاه‌دار که قَلّابِ شهر، صرّاف است
""",

"غزل۴۵" : """در این زمانه رفیقی که خالی از خِلَل است
صُراحیِ میِ ناب و سفینهٔ غزل است
جریده رو، که گذرگاهِ عافیت تنگ است
پیاله گیر، که عمرِ عزیز بی‌بدل است
نه من ز بی‌عملی در جهان ملولم و بس
ملالتِ عُلما هم ز علمِ بی‌عمل است
به چشمِ عقل در این رهگذار پرآشوب
جهان و کار جهان بی‌ثبات و بی‌محل است
بگیر طُرِّهٔ مه‌چهره‌ای و قصّه مخوان
که سعد و نحس ز تأثیر زهره و زحل است
دلم امید فراوان به وصلِ رویِ تو داشت
ولی اجل به رَهِ عمر رهزن امل است
به هیچ دور نخواهند یافت هشیارش
چنین که حافظ ما مستِ بادهٔ ازل است
""",

"غزل۴۶" : """گل در بر و می در کف و معشوق به کام است
سلطانِ جهانم به چنین روز غلام است
گو شمع میارید در این جمع که امشب
در مجلس ما ماهِ رخِ دوست تمام است
در مذهبِ ما باده حلال است ولیکن
بی‌روی تو ای سرو گل‌اندام حرام است
گوشم همه بر قولِ نی و نغمهٔ چنگ است
چشمم همه بر لعلِ لب و گردش جام است
در مجلسِ ما عطر میامیز که ما را
هر لحظه ز گیسوی تو خوش بوی مشام است
از چاشنی قند مگو هیچ و زِ شِکَّر
زان رو که مرا از لبِ شیرینِ تو کام است
تا گنجِ غمت در دلِ ویرانه مقیم است
همواره مرا کوی خرابات مقام است
از ننگ چه گویی که مرا نام ز ننگ است
وز نام چه پرسی که مرا ننگ ز نام است
مِی‌خواره و سرگشته و رندیم و نظرباز
وان کس که چو ما نیست در این شهر کدام است؟
با محتسبم عیب مگویید که او نیز
پیوسته چو ما در طلبِ عیشِ مدام است
حافظ منشین بی‌می و معشوق زمانی
کایّام گل و یاسمن و عید صیام است
""",

"غزل۴۷" : """به کوی میکده هر سالِکی که ره دانست
دری دگر زدن اندیشهٔ تَبَه دانست
زمانه افسر رندی نداد جز به کسی
که سرفرازیِ عالم در این کُلَه دانست
بر آستانهٔ میخانه هر که یافت رهی
ز فیضِ جامِ می اسرار خانقه دانست
هر آن که رازِ دو عالم ز خطِ ساغر خواند
رموزِ جامِ جم از نقشِ خاکِ ره دانست
ورای طاعتِ دیوانگان ز ما مطلب
که شیخِ مذهبِ ما عاقلی گنه دانست
دلم ز نرگسِ ساقی امان نخواست به جان
چرا که شیوهٔ آن تُرک دل سیه، دانست
ز جورِ کوکبِ طالع سحرگهان چشمم
چنان گریست که ناهید دید و مه دانست
حدیثِ حافظ و ساغر که می‌زند پنهان
چه جایِ محتسب و شَحنه، پادشه دانست
بلندمرتبه شاهی که نُه رواق سِپهر
نمونه‌ای ز خَمِ طاقِ بارگه دانست
""",

"غزل۴۸" : """صوفی از پرتو می راز نهانی دانست
گوهر هر کس از این لعل، توانی دانست
قدر مجموعهٔ گل مرغِ سحر داند و بس
که نه هر کو ورقی خواند، معانی دانست
عرضه کردم دو جهان بر دلِ کارافتاده
بجز از عشقِ تو باقی همه فانی دانست
آن شد اکنون که ز ابنای عوام اندیشم
محتسب نیز در این عیشِ نهانی دانست
دلبر آسایش ما مصلحت وقت ندید
ور نه از جانبِ ما دل نگرانی دانست
سنگ و گِل را کُنَد از یُمنِ نظر لعل و عقیق
هر که قدرِ نفسِ بادِ یمانی دانست
ای که از دفترِ عقل آیت عشق آموزی
ترسم این نکته به تحقیق ندانی دانست
می بیاور که ننازد به گلِ باغِ جهان
هر که غارتگریِ بادِ خزانی دانست
حافظ این گوهر منظوم که از طبع انگیخت
ز اثرِ تربیتِ آصفِ ثانی دانست
""",

"غزل۴۹" : """روضهٔ خُلدِ برین خلوت درویشان است
مایهٔ محتشمی خدمتِ درویشان است
گَنج عُزلت که طلسماتِ عجایب دارد
فتحِ آن در نظرِ رحمتِ درویشان است
قصرِ فردوس که رضوانش به دربانی رفت
مَنظَری از چمنِ نُزهَتِ درویشان است
آن چه زر می‌شود از پرتو آن قلبِ سیاه
کیمیاییست که در صحبتِ درویشان است
آن که پیشش بِنَهَد تاجِ تکبر خورشید
کبریاییست که در حشمتِ درویشان است
دولتی را که نباشد غم از آسیبِ زوال
بی تکلف بشنو دولتِ درویشان است
خسروان قبلهٔ حاجاتِ جهانند ولی
سببش بندگیِ حضرتِ درویشان است
روی مقصود که شاهان به دعا می‌طلبند
مَظهَرَش آینهٔ طلعتِ درویشان است
از کران تا به کران لشکر ظلم است ولی
از ازل تا به ابد، فرصتِ درویشان است
ای توانگر مَفُروش این همه نِخوَت که تو را
سر و زر در کنفِ همتِ درویشان است
گنجِ قارون که فرو می‌شود از قهر هنوز
خوانده باشی که هم از غیرتِ درویشان است
حافظ ار آبِ حیاتِ ازلی می‌خواهی
منبعش خاکِ درِ خلوتِ درویشان است
من غلامِ نظرِ آصفِ عهدم کو را
صورتِ خواجگی و سیرتِ درویشان است
""",

"غزل۵۰" : """به دامِ زلفِ تو دل مبتلایِ خویشتن است
بکُش به غمزه که اینش سزایِ خویشتن است
گرت ز دست برآید مرادِ خاطرِ ما
به دست باش که خیری به جایِ خویشتن است
به جانت ای بتِ شیرین دهن که همچون شمع
شبانِ تیره مرادم فنای خویشتن است
چو رای عشق زدی با تو گفتم ای بلبل
مَکُن که آن گلِ خندان به رای خویشتن است
به مشک چین و چِگِل نیست بوی گل محتاج
که نافه‌هاش ز بندِ قبایِ خویشتن است
مرو به خانهٔ اربابِ بی‌مروتِ دهر
که گنجِ عافیتت در سرای خویشتن است
بسوخت حافظ و در شرطِ عشقبازی او
هنوز بر سرِ عهد و وفایِ خویشتن است
""",

"غزل۵۱" : """
""",

"غزل۵۲" : """
""",

"غزل۵۳" : """
""",

"غزل۵۴" : """
""",

"غزل۵۵" : """
""",

"غزل۵۶" : """
""",

"غزل۵۷" : """
""",

"غزل۵۸" : """
""",

"غزل۵۹" : """
""",

"غزل۶۰" : """
""",

"غزل۶۱" : """
""",

"غزل۶۲" : """
""",

"غزل۶۳" : """
""",

"غزل۶۴" : """
""",

"غزل۶۵" : """
""",

"غزل۶۶" : """
""",

"غزل۶۷" : """
""",


"غزل۶۸" : """
""",

"غزل۶۹" : """
""",

"غزل۷۰" : """
""",

"غزل۷۱" : """
""",

"غزل۷۲" : """
""",

"غزل۷۳" : """
""",

"غزل۷۳" : """
""",

"غزل۷۴" : """
""",

"غزل۷۵" : """
""",

"غزل۷۵" : """
""",

"غزل۷۶" : """
""",

"غزل۷۷" : """
""",

"غزل۷۸" : """
""",

"غزل۷۹" : """
""",

"غزل۸۰" : """
""",

"غزل۸۱" : """
""",

"غزل۸۲" : """
""",

"غزل۸۳" : """
""",

"غزل۸۴" : """
""",

"غزل۸۵" : """
""",

"غزل۸۶" : """
""",

"غزل۸۷" : """
""",

"غزل۸۸" : """
""",

"غزل۸۹" : """
""",

"غزل۹۰" : """
""",

"غزل۹۱" : """
""",

"غزل۹۲" : """
""",

"غزل۹۳" : """
""",

"غزل۹۴" : """
""",

"غزل۹۵" : """
""",

"غزل۹۶" : """
""",

"غزل۹۷" : """
""",

"غزل۹۸" : """
""",

"غزل۹۹" : """
""",

"غزل۱۰۰" : """
"""
}